[
  {
    "Recipe Name": "Classic Pancakes",
    "Category": "Breakfast",
    "Calories": "100 calories per pancake",
    "Ingredients": "1 egg\n1 cup all-purpose flour\n1 tablespoon sugar\n3 teaspoons baking powder\n1/4 teaspoon salt\n3/4 cup milk\n2 tablespoons vegetable oil or melted butter",
    "Directions": "In a medium bowl, beat the egg with a wire whisk until fluffy. Stir in the remaining ingredients just until the flour is moistened (the batter will be slightly lumpy); do not overmix or pancakes will be tough. For thinner pancakes, stir in an additional 1 to 2 tablespoons of milk.\nHeat a griddle or skillet over medium-high heat (375°F). (To test the griddle, sprinkle with a few drops of water. If bubbles jump around, the heat is just right.) Brush with vegetable oil if necessary (or spray with cooking spray before heating).\nFor each pancake, pour slightly less than 1/4 cup of batter onto the griddle. Cook for 2 to 3 minutes or until bubbly on top and dry around edges. Turn and cook the other side until golden brown."
  },
  {
    "Recipe Name": "French Toast",
    "Category": "Breakfast",
    "Calories": "240 calories per serving.",
    "Ingredients": "2/3 cup milk\n2 large eggs\n1 teaspoon vanilla extract (optional)\n1/4 teaspoon ground cinnamon (optional)\nSalt to taste\n6 thick slices of bread\n1 tablespoon unsalted butter, or more as needed",
    "Directions": "Whisk milk, eggs, vanilla, cinnamon, and salt together in a shallow bowl.\nLightly butter a griddle or skillet and heat over medium-high heat.\nDunk bread in the egg mixture, soaking both sides.\nTransfer to the hot skillet and cook until golden, about 3 to 4 minutes per side.\nServe hot."
  },
  {
    "Recipe Name": "Omelette with Spinach and Cheese",
    "Category": "Breakfast",
    "Calories": "255 calories per serving.",
    "Ingredients": "2 large eggs\n1 teaspoon extra-virgin olive oil\n1 cup spinach\n2 tablespoons shredded Cheddar cheese\n1 teaspoon chopped fresh dill",
    "Directions": "Whisk eggs in a small bowl.\nHeat oil in a small nonstick skillet over medium-high heat, tilting to coat the pan.\nPour in the eggs and immediately stir with a rubber spatula for 5 to 10 seconds. Push the cooked portions at the edge toward the center, tilting the pan to allow uncooked egg to fill in around the edges. Continue to cook until almost set and the bottom is light golden, about 1 minute in total.\nRemove from heat and top half the omelet with spinach and Cheddar. Fold the other half over the filling.\nSlide the omelet onto a plate and sprinkle dill on top."
  },
  {
    "Recipe Name": "Avocado Toast",
    "Category": "Breakfast",
    "Calories": "200 calories per serving",
    "Ingredients": "1 ripe avocado\n2 slices of whole-grain bread\nSalt and pepper, to taste\nOptional toppings: lemon juice, red pepper flakes, olive oil, or flaky sea salt",
    "Directions": "Toast the bread slices to your desired level of crispiness.\nMash the avocado in a bowl and season it with salt and pepper. You can also add lemon juice for extra flavor.\nSpread the mashed avocado evenly over the toasted bread slices.\nAdd any additional toppings like a drizzle of olive oil, red pepper flakes, or a sprinkle of sea salt."
  },
  {
    "Recipe Name": "Greek Yogurt Parfait with Berries and Granola",
    "Category": "Breakfast",
    "Calories": "298 calories per serving",
    "Ingredients": "1 tablespoon honey or maple syrup (optional)\n3/4 cup plain Greek yogurt\n1/4 cup berries (or any other fruit cut into small 1-inch chunks)\n1/4 cup homemade granola or store-bought granola",
    "Directions": "If using a sweetener, mix it with Greek yogurt in a small bowl until fully combined.\nTo layer the yogurt parfait, place half of the yogurt at the bottom of a mason jar or a bowl.\nTop it off with half of the fruit and half of the granola.\nCover them with the rest of the yogurt and top it off with the rest of the fruit and granola.\nIf preferred, finish it off with a drizzle of honey. Serve immediately."
  },
  {
    "Recipe Name": "Banana Nut Muffins",
    "Category": "Breakfast",
    "Calories": "218 calories per muffin.",
    "Ingredients": "1 1/2 cups all-purpose flour\n1 teaspoon baking powder\n1 teaspoon baking soda\n1/2 teaspoon salt\n1/2 cup pecan halves, chopped\n3 large ripe bananas, peeled\n3/4 cup granulated sugar\n1/3 cup unsalted butter, melted\n1 egg, beaten",
    "Directions": "Preheat your oven to 350 degrees F. Line a standard muffin tin with paper liners or coat the cups with baking spray.\nIn a medium bowl, combine the flour, baking powder, baking soda, salt, and pecans.\nIn a large bowl, mash the bananas and then stir in the sugar. Add the egg and mix well. Then stir in the melted butter gradually.\nDump the dry ingredients into the wet ingredients and stir until just combined. (Be sure to not over mix!)\nFill each muffin tin cup with muffin batter. Bake for 20 to 25 minutes. (If you’re using a large muffin tin, increase the baking time to 30-35 minutes, using the toothpick test to check for doneness.)\nThe muffins are done when a toothpick comes out clean when inserted into the center. Remove the muffins to a wire rack to cool. Serve warm or at room temperature."
  },
  {
    "Recipe Name": "Veggie Breakfast Burrito",
    "Category": "Breakfast",
    "Calories": "484 calories per burrito",
    "Ingredients": "Six 8” whole grain tortillas\n1 full batch homemade hash browns\n6 large eggs\n1 cup cooked pinto beans or black beans (canned beans, rinsed and drained)\n1/4 teaspoon salt\nSeveral dashes of hot sauce, such as Cholula\n1 tablespoon unsalted butter\n2/3 cup (packed) shredded sharp cheddar cheese\n1/2 cup chopped cilantro, divided\n1/2 cup chopped green onion (mostly green parts), divided\n6 tablespoons of your favorite salsa, plus extra for serving\n1 large avocado, diced (optional, if you’re serving the burritos right away)",
    "Directions": "Crack the eggs into a medium bowl and whisk them with a fork until the mixture is pale yellow. Stir in the beans and season with the salt and hot sauce.\nMelt the butter in a medium-sized skillet over medium heat. Pour in the egg mixture and cook, stirring often, until the eggs are just set, about 2 to 4 minutes. Stir in the cheese and transfer the mixture to a bowl. Then stir in the cilantro and green onion.\nQuickly run each tortilla under running water and warm them briefly in the microwave or in a skillet.\nWorking with one tortilla at a time, spread about ⅓ cup hash browns on a tortilla about one-third from the edge. Drizzle 1 tablespoon salsa on top of the hash browns. Top with about ⅓ cup scrambled eggs.\nRoll up the burrito by first folding the tortilla over from the bottom to partially cover the contents, then fold in the two sides. Finish rolling and put the burrito seam side down on a plate. Repeat with the remaining burritos.\nIf serving right away, you can halve the burritos or serve them whole. Warm some extra salsa and pour it over the burritos. Top with diced avocado (if using) and the reserved cilantro and green onion. Serve immediately.\nIf freezing the burritos for later, let them cool to room temperature, then wrap each burrito in plastic wrap. Transfer the wrapped burritos to a freezer-safe bag and store in the freezer."
  },
  {
    "Recipe Name": "Shakshuka (Poached Eggs in Spicy Tomato Sauce)",
    "Category": "Breakfast",
    "Calories": "386 calories per serving",
    "Ingredients": "1 tablespoon olive oil\n1 medium onion, chopped\n1 red bell pepper, chopped\n1-2 spicy peppers, chopped (optional, for extra spicy)\n3 cloves garlic, chopped\n1 tablespoon paprika (use hot, sweet, or smoked - add cayenne pepper for extra spicy)\n1/2 teaspoon ground cumin\nSalt and pepper to taste\n1 28-ounce can whole tomatoes (or equivalent of fresh tomatoes), chopped (fire roasted tomatoes are great here)\n3 tablespoons chopped cilantro\n6 eggs\nCrumbled feta (or other crumbly white cheese) cheese and fresh chopped herbs for topping, hot sauce to taste",
    "Directions": "Heat a 10-inch skillet to medium heat and add olive oil.\nAdd onion and peppers. Cook them down for 6-7 minutes, until they are nicely browned and beginning to caramelize.\nAdd garlic, paprika, cumin, and salt and pepper. Cook another minute.\nAdd tomatoes and break apart with a wooden spoon. Bring to a boil, then reduce heat and simmer for 10 minutes or up to 30 minutes to let the flavors develop nicely.\nStir in 2 tablespoons of the chopped cilantro. With a small spoon, form 6 small indentations for the eggs. Crack the eggs into the indentations. Spoon a bit of the sauce over the egg whites to help them set and cover.\nSimmer, covered, about 7-8 minutes, or until the eggs whites have set.\nRemove from heat and let sit a couple more minutes for the yolks to set to your preference.\nTop with remaining cilantro and crumbled feta cheese. Serve with crusty bread and hot sauce to taste."
  },
  {
    "Recipe Name": "Belgian Waffles",
    "Category": "Breakfast",
    "Calories": "376 calories per waffel",
    "Ingredients": "2 cups all-purpose flour\n2 tablespoons sugar\n1 tablespoon baking powder\n1/2 teaspoon salt\n2 large eggs\n1 3/4 cups milk\n1/2 cup vegetable oil\n1 teaspoon vanilla extract",
    "Directions": "In a mixing bowl, whisk together the flour, sugar, baking powder, and salt.\nIn another bowl, beat the eggs and then add the milk, vegetable oil, and vanilla extract. Mix well.\nPour the wet ingredients into the dry ingredients and stir until just combined. Be careful not to overmix; some lumps are okay.\nPreheat a waffle iron and lightly grease it.\nPour the waffle batter onto the hot waffle iron and cook according to the manufacturer's instructions until golden brown and crispy.\nServe the Belgian waffles with your favorite toppings like fresh berries, maple syrup, or whipped cream."
  },
  {
    "Recipe Name": "Smoothie Bowl with Fresh Fruits",
    "Category": "Breakfast",
    "Calories": "284 calories per serving",
    "Ingredients": "1 cup frozen mixed berries\n1/2 frozen banana\n1/2 cup Greek yogurt\n1/4 cup almond milk (or any milk of your choice)\n1 tablespoon honey or maple syrup (optional, for sweetness)\nToppings: Fresh sliced fruits (e.g., strawberries, kiwi, banana), granola, chia seeds, shredded coconut, and honey drizzle.",
    "Directions": "In a blender, combine the frozen mixed berries, frozen banana, Greek yogurt, and almond milk.\nBlend until smooth and creamy. You may need to stop and scrape down the sides of the blender to ensure everything is well mixed.\nTaste the smoothie mixture and add honey or maple syrup if you desire extra sweetness. Blend again briefly to combine.\nPour the smoothie mixture into a bowl.\nAdd your choice of toppings. Arrange fresh sliced fruits, granola, chia seeds, shredded coconut, and drizzle with honey on top of the smoothie.\nEnjoy your colorful and nutritious smoothie bowl!"
  },
  {
    "Recipe Name": "Caesar Salad",
    "Category": "Lunch",
    "Calories": "155 calories per serving",
    "Ingredients": "Romaine lettuce\nCroutons\nGrated Parmesan cheese\nCaesar dressing",
    "Directions": "Wash and chop the Romaine lettuce into bite-sized pieces.\nToss the lettuce with croutons and grated Parmesan cheese.\nDrizzle Caesar dressing over the salad to taste.\nToss the salad until the dressing evenly coats the lettuce, croutons, and cheese.\nServe immediately as a side or add grilled chicken or shrimp for a complete meal."
  },
  {
    "Recipe Name": "Grilled Cheese Sandwich",
    "Category": "Lunch",
    "Calories": "460 calories per sandwhich",
    "Ingredients": "2 slices of bread\n2 slices of cheese (e.g., cheddar, American, Swiss)\nButter or margarine for spreading (optional)",
    "Directions": "Heat a non-stick skillet or griddle over medium heat.\nSpread butter on one side of each slice of bread if desired.\nPlace one slice of bread, buttered side down, on the skillet.\nAdd the cheese slices on top of the bread.\nPlace the second slice of bread on top, buttered side up.\nCook until the bread is golden brown and the cheese is melted, usually 2-4 minutes per side.\nRemove from heat, let it cool for a minute, then cut in half if desired, and serve."
  },
  {
    "Recipe Name": "Quinoa Salad with Mixed Vegetables",
    "Category": "Lunch",
    "Calories": "395 calories per serving",
    "Ingredients": "1 cup quinoa\nMixed vegetables (e.g., cucumbers, tomatoes, bell peppers, carrots)\nOlive oil\nLemon juice\nSalt and pepper to taste",
    "Directions": "Cook quinoa according to package instructions and let it cool.\nChop the mixed vegetables into bite-sized pieces.\nIn a large bowl, combine the cooked and cooled quinoa with the chopped vegetables.\nDrizzle with olive oil and lemon juice, then season with salt and pepper.\nToss everything together until well combined.\nServe chilled."
  },
  {
    "Recipe Name": "Tomato Basil Soup",
    "Category": "Lunch",
    "Calories": "206 calories per serving",
    "Ingredients": "2 1/2 pounds roma tomatoes, halved\n1/4 cup extra-virgin olive oil, divided\n1 medium yellow onion, chopped\n1/3 cup chopped carrots\n4 garlic cloves, chopped\n3 cups vegetable broth\n1 tablespoon balsamic vinegar\n1 teaspoon thyme leaves\n1 loose-packed cup basil leaves, more for garnish\nSea salt and freshly ground black pepper",
    "Directions": "Preheat the oven to 350°F and line a large baking sheet with parchment paper. Place the tomatoes cut-side up on the baking sheet, drizzle with 2 tablespoons of the olive oil, and sprinkle with salt and pepper. Roast for 1 hour or until the edges just start to shrivel and the insides are still juicy.\nHeat the remaining 2 tablespoons of olive oil in a large pot over medium heat. Add the onions, carrots, garlic, and ½ teaspoon salt and cook until soft, about 8 minutes. Stir in the tomatoes, vegetable broth, vinegar, and thyme leaves and simmer for 20 minutes.\nLet cool slightly and pour the soup into a blender, working in batches if necessary. Blend until smooth. Add the basil and pulse until combined.\nGarnish the soup with basil leaves and serve with crusty bread."
  },
  {
    "Recipe Name": "Chicken Caesar Wrap",
    "Category": "Lunch",
    "Calories": "428 calories per wrap",
    "Ingredients": "1 large flour tortilla \n2 ounces grilled chicken breast strips \n1 cup Romaine lettuce leaves \n2 tablespoons Caesar dressing",
    "Directions": "Lay the tortilla flat on a clean surface.\nArrange the Romaine lettuce leaves in the center of the tortilla.\nPlace the chicken breast strips on top of the lettuce.\nDrizzle Caesar dressing over the chicken.\nFold in the sides of the tortilla and then roll it up from the bottom.\nSlice in half if desired, and serve."
  },
  {
    "Recipe Name": "Sushi Rolls",
    "Category": "Lunch",
    "Calories": "295 calories per roll",
    "Ingredients": "1 cup cooked sushi rice\n1 sheet of nori seaweed\nFillings (varies):\n2 slices of avocado\n2 slices of cucumber \n2 ounces of cooked crab meat or similar fish \nSoy sauce, pickled ginger, and wasabi for dipping",
    "Directions": "Lay a bamboo sushi rolling mat on a clean surface. Place a sheet of plastic wrap on top of the bamboo mat.\nPlace a sheet of nori seaweed, shiny side down, on the plastic wrap.\nWet your hands to prevent sticking and spread a thin layer of sushi rice on the nori, leaving a small border at the top.\nAdd your choice of fillings on top of the rice.\nRoll the sushi tightly using the bamboo mat, applying gentle pressure.\nSlice the sushi roll into bite-sized pieces using a sharp knife.\nServe with soy sauce, pickled ginger, and wasabi if desired."
  },
  {
    "Recipe Name": "Falafel Pita Sandwich",
    "Category": "Lunch",
    "Calories": "541 calories per sandwhich",
    "Ingredients": "4 falafel patties\n2 whole wheat pita bread rounds\n1/2 cup diced tomatoes\n1/2 cup diced cucumbers\n1/4 cup diced red onions\n1/4 cup chopped fresh parsley\n1/4 cup tahini sauce\n1 tablespoon olive oil\nSalt and pepper to taste",
    "Directions": "Heat the falafel patties according to the package instructions or cook them in a skillet until heated through and slightly crispy.\nWarm the pita bread rounds in the oven or on a stovetop griddle.\nIn a small bowl, mix together the diced tomatoes, cucumbers, red onions, and fresh parsley. Season with salt and pepper.\nAssemble the sandwiches by placing 2 falafel patties inside each pita bread round.\nTop with the fresh vegetable mixture and drizzle with tahini sauce.\nServe immediately."
  },
  {
    "Recipe Name": "Pad Thai Noodles",
    "Category": "Lunch",
    "Calories": "822 calories per serving",
    "Ingredients": "8 oz rice noodles\n2 tablespoons vegetable oil\n2 cloves garlic, minced\n1/2 cup tofu, diced (optional)\n1/2 cup cooked chicken or shrimp (optional)\n2 eggs, beaten\n1 cup bean sprouts\n1/4 cup chopped peanuts\n3 tablespoons fish sauce\n2 tablespoons soy sauce\n2 tablespoons brown sugar\n1 tablespoon lime juice\nRed pepper flakes (optional)\nChopped cilantro and lime wedges for garnish",
    "Directions": "Cook rice noodles according to package instructions. Drain and set aside.\nIn a large skillet, heat vegetable oil over medium-high heat. Add minced garlic and sauté for 30 seconds.\nAdd tofu, chicken, or shrimp (if using) and cook until heated through.\nPush the ingredients to one side of the skillet and pour the beaten eggs into the other side. Scramble the eggs until cooked.\nAdd cooked rice noodles, bean sprouts, and chopped peanuts to the skillet.\nIn a small bowl, mix together fish sauce, soy sauce, brown sugar, and lime juice. Pour this sauce over the noodles and toss everything together.\nSeason with red pepper flakes if you like it spicy.\nGarnish with chopped cilantro and serve with lime wedges."
  },
  {
    "Recipe Name": "Margherita Pizza",
    "Category": "Lunch",
    "Calories": "176 calories per slice",
    "Ingredients": "1 pizza dough\n1/2 cup tomato sauce\n1 1/2 cups shredded mozzarella cheese\nFresh basil leaves\nOlive oil\nSalt and pepper to taste",
    "Directions": "Preheat your oven to the highest temperature it can go (usually around 475-500°F or 245-260°C).\nRoll out the pizza dough on a floured surface to your desired thickness.\nPlace the dough on a pizza stone or baking sheet.\nSpread tomato sauce evenly over the dough, leaving a small border around the edges.\nSprinkle shredded mozzarella cheese over the sauce.\nTear fresh basil leaves and scatter them over the cheese.\nDrizzle a bit of olive oil over the top and season with salt and pepper.\nBake in the preheated oven for 10-15 minutes or until the crust is golden and the cheese is bubbly.\nSlice and serve."
  },
  {
    "Recipe Name": "Veggie Burger",
    "Category": "Lunch",
    "Calories": "284 calories per burger",
    "Ingredients": "1 veggie burger patty (store-bought or homemade)\n1 whole wheat burger bun\nLettuce leaves\nSliced tomatoes\nSliced onions\nPickles (optional)\nKetchup and mustard (optional)",
    "Directions": "Cook the veggie burger patty according to package instructions or your preferred method (grilling, pan-frying, etc.).\nToast the burger bun if desired.\nAssemble the burger by placing lettuce, sliced tomatoes, onions, and pickles (if using) on the bottom bun.\nAdd the cooked veggie burger patty on top.\nSpread ketchup and mustard on the top bun (if desired) and place it on the burger.\nServe immediately."
  },
  {
    "Recipe Name": "Spaghetti Carbonara",
    "Category": "Dinner",
    "Calories": "368 calories per serving",
    "Ingredients": "8 oz spaghetti\n2 large eggs\n1 cup grated Parmesan cheese\n4 oz pancetta or guanciale, diced\n2 cloves garlic, minced\nSalt and black pepper to taste\nChopped fresh parsley for garnish",
    "Directions": "Cook spaghetti according to package instructions until al dente. Drain and set aside.\nIn a bowl, whisk together the eggs and grated Parmesan cheese. Season with black pepper (be cautious with salt, as the pancetta is salty).\nIn a large skillet, cook the diced pancetta or guanciale over medium heat until it becomes crispy. Remove from heat and drain excess fat, leaving about 2 tablespoons in the pan.\nAdd minced garlic to the skillet with the pancetta fat and sauté for about 1 minute until fragrant.\nToss the cooked spaghetti in the skillet with the pancetta and garlic.\nRemove the skillet from heat and quickly stir in the egg and cheese mixture. The heat from the pasta will cook the eggs, creating a creamy sauce.\nSeason with additional black pepper if desired.\nGarnish with chopped fresh parsley and serve immediately."
  },
  {
    "Recipe Name": "Chicken Tikka Masala",
    "Category": "Dinner",
    "Calories": "611 calories per serving",
    "Ingredients": "1 pound boneless, skinless chicken thighs, cut into bite-sized pieces\n1 cup plain yogurt\n2 tablespoons lemon juice\n2 teaspoons ground cumin\n2 teaspoons ground coriander\n2 teaspoons paprika\n1 teaspoon turmeric\n1 teaspoon garam masala\n1 teaspoon chili powder (adjust to taste)\n2 tablespoons vegetable oil\n1 large onion, finely chopped\n3 cloves garlic, minced\n1-inch piece of fresh ginger, grated\n1 can (14 oz) crushed tomatoes\n1 cup heavy cream\nSalt and pepper to taste\nFresh cilantro leaves for garnish",
    "Directions": "In a bowl, combine yogurt, lemon juice, cumin, coriander, paprika, turmeric, garam masala, and chili powder. Mix well.\nAdd chicken pieces to the yogurt mixture and marinate for at least 30 minutes, or overnight in the refrigerator.\nHeat vegetable oil in a large pan over medium heat. Add onions and cook until they become translucent.\nStir in garlic and ginger, and cook for another 1-2 minutes.\nAdd the marinated chicken and cook until browned.\nPour in crushed tomatoes and heavy cream. Season with salt and pepper.\nSimmer for about 20-30 minutes, stirring occasionally, until the chicken is cooked through and the sauce thickens.\nGarnish with fresh cilantro leaves and serve hot with rice or naan bread."
  },
  {
    "Recipe Name": "Beef Tacos",
    "Category": "Dinner",
    "Calories": "201 calroies per taco",
    "Ingredients": "1 pound ground beef\n1 packet taco seasoning mix\n8 small taco shells or tortillas\n1 cup shredded lettuce\n1 cup diced tomatoes\n1/2 cup shredded cheddar cheese\n1/4 cup diced onions\nSour cream and salsa (optional)\nFresh cilantro leaves for garnish (optional)",
    "Directions": "In a skillet, brown the ground beef over medium-high heat, breaking it into crumbles as it cooks.\nDrain excess fat, and then add the taco seasoning mix according to the package instructions.\nHeat taco shells or tortillas in the oven or microwave.\nFill each shell with the seasoned beef.\nTop with shredded lettuce, diced tomatoes, shredded cheddar cheese, diced onions, sour cream, salsa, and cilantro as desired.\nServe hot."
  },
  {
    "Recipe Name": "Vegetarian Lasagna",
    "Category": "Dinner",
    "Calories": "351 calories per serving",
    "Ingredients": "9 lasagna noodles, cooked and drained\n2 cups ricotta cheese\n2 cups shredded mozzarella cheese\n1 cup grated Parmesan cheese\n2 cups spinach or other vegetables (e.g., mushrooms, zucchini), sautéed and drained\n2 cups marinara sauce\n2 teaspoons Italian seasoning\nSalt and pepper to taste",
    "Directions": "Preheat your oven to 375°F (190°C).\nIn a bowl, combine ricotta cheese, 1 cup mozzarella cheese, 1/2 cup Parmesan cheese, and Italian seasoning. Mix well. Season with salt and pepper.\nIn a 9x13-inch baking dish, spread a thin layer of marinara sauce.\nPlace 3 lasagna noodles on top of the sauce.\nSpread half of the ricotta cheese mixture over the noodles.\nAdd half of the sautéed spinach or other vegetables.\nRepeat the layers: marinara sauce, noodles, ricotta cheese mixture, vegetables.\nTop with the remaining marinara sauce and the remaining mozzarella and Parmesan cheeses.\nCover with foil and bake for 25 minutes.\nRemove the foil and bake for an additional 15 minutes, until the lasagna is bubbly and cheese is golden.\nLet it rest for a few minutes before serving."
  },
  {
    "Recipe Name": "Grilled Salmon with Asparagus",
    "Category": "Dinner",
    "Calories": "275 calories per serving",
    "Ingredients": "4 salmon fillets\n1 bunch asparagus, trimmed\n2 tablespoons olive oil\n2 cloves garlic, minced\n1 lemon, sliced\nSalt and pepper to taste\nFresh dill or parsley for garnish",
    "Directions": "Preheat your grill to medium-high heat.\nIn a bowl, toss the asparagus with olive oil, minced garlic, salt, and pepper.\nSeason the salmon fillets with salt and pepper.\nPlace salmon fillets and asparagus on the grill.\nGrill salmon for about 4-5 minutes per side, or until it flakes easily with a fork.\nGrill asparagus for about 3-4 minutes, turning occasionally until tender and slightly charred.\nServe grilled salmon with asparagus, garnish with lemon slices and fresh dill or parsley."
  },
  {
    "Recipe Name": "Thai Green Curry with Rice",
    "Category": "Dinner",
    "Calories": "411 calories per serving",
    "Ingredients": "1 pound boneless, skinless chicken breast or tofu, cut into bite-sized pieces\n2 tablespoons green curry paste\n1 can (14 oz) coconut milk\n1 cup green beans, trimmed and halved\n1 red bell pepper, sliced\n1 tablespoon fish sauce or soy sauce for vegetarian/vegan version\n1 teaspoon sugar\n1 lime, juiced\nFresh basil leaves for garnish\nCooked jasmine rice",
    "Directions": "In a large pan or wok, heat green curry paste over medium-high heat for a minute.\nAdd chicken or tofu and cook until it's no longer pink (about 5-7 minutes for chicken or until tofu is slightly browned).\nPour in the coconut milk and bring to a gentle boil.\nAdd green beans and red bell pepper. Simmer until vegetables are tender, about 5-7 minutes.\nStir in fish sauce or soy sauce and sugar.\nRemove from heat and add lime juice.\nServe over cooked jasmine rice and garnish with fresh basil leaves."
  },
  {
    "Recipe Name": "BBQ Pulled Pork Sandwich",
    "Category": "Dinner",
    "Calories": "490 calories per sandwhich",
    "Ingredients": "2 pounds boneless pork shoulder\n1 cup barbecue sauce\n1 onion, chopped\n2 cloves garlic, minced\n1 teaspoon salt\n1/2 teaspoon black pepper\n1/2 teaspoon smoked paprika\n8 hamburger buns",
    "Directions": "Place the pork shoulder in a slow cooker.\nIn a bowl, mix together the barbecue sauce, chopped onion, minced garlic, salt, black pepper, and smoked paprika. Pour the mixture over the pork.\nCover and cook on low for 8-10 hours or until the pork is tender and can be easily shredded.\nShred the pork using two forks and mix it with the sauce.\nServe the pulled pork on hamburger buns."
  },
  {
    "Recipe Name": "Mushroom Risotto",
    "Category": "Dinner",
    "Calories": "382 calories per serving",
    "Ingredients": "1 cup Arborio rice\n8 ounces mushrooms, sliced\n4 cups chicken or vegetable broth\n1 small onion, finely chopped\n2 cloves garlic, minced\n1/2 cup dry white wine (optional)\n2 tablespoons butter\n2 tablespoons olive oil\n1/2 cup grated Parmesan cheese\nSalt and pepper to taste\nFresh parsley for garnish (optional)",
    "Directions": "In a saucepan, bring the chicken or vegetable broth to a simmer and keep it warm.\nIn a large skillet, heat the olive oil and butter over medium heat. Add the chopped onion and garlic and sauté until translucent.\nAdd the Arborio rice to the skillet and cook for a couple of minutes, stirring constantly.\nIf using wine, pour it into the skillet and cook until it is mostly absorbed by the rice.\nAdd the sliced mushrooms and continue to cook, stirring occasionally, until they are tender.\nBegin adding the warm broth to the rice mixture, one ladle at a time, stirring constantly. Allow the liquid to be absorbed before adding more broth.\nContinue this process until the rice is creamy and cooked to your desired level of doneness.\nStir in the grated Parmesan cheese and season with salt and pepper.\nGarnish with fresh parsley if desired."
  },
  {
    "Recipe Name": "Lamb Chops with Mint Sauce",
    "Category": "Dinner",
    "Calories": "219 calories per chop",
    "Ingredients": "4 lamb chops\nSalt and black pepper to taste\n2 tablespoons olive oil\n1/4 cup fresh mint leaves, chopped\n1/4 cup plain yogurt\n1 clove garlic, minced\n1 teaspoon lemon juice",
    "Directions": "Season the lamb chops with salt and black pepper.\nHeat the olive oil in a skillet over medium-high heat. Add the lamb chops and cook to your desired level of doneness (about 3-4 minutes per side for medium-rare).\nIn a small bowl, combine the chopped mint leaves, plain yogurt, minced garlic, and lemon juice to make the mint sauce.\nServe the cooked lamb chops with a drizzle of mint sauce."
  },
  {
    "Recipe Name": "Eggplant Parmesan",
    "Category": "Dinner",
    "Calories": "439 calories per serving",
    "Ingredients": "2 large eggplants, sliced into rounds\n2 cups marinara sauce\n2 cups shredded mozzarella cheese\n1 cup grated Parmesan cheese\n1 cup all-purpose flour\n3 eggs, beaten\nSalt and black pepper to taste\nOlive oil for frying\nFresh basil leaves for garnish (optional)",
    "Directions": "Preheat your oven to 375°F (190°C).\nPlace the sliced eggplants on a baking sheet, sprinkle with salt, and let them sit for about 30 minutes to release excess moisture. Then, pat them dry with paper towels.\nDredge the eggplant slices in flour, dip them in beaten eggs, and then coat with breadcrumbs.\nHeat olive oil in a skillet over medium-high heat. Fry the eggplant slices until they are golden brown on both sides. Place them on paper towels to drain excess oil.\nIn a baking dish, spread a layer of marinara sauce, followed by a layer of fried eggplant slices, a layer of mozzarella cheese, and a sprinkle of grated Parmesan cheese. Repeat the layers until all ingredients are used.\nBake in the preheated oven for about 25-30 minutes or until the cheese is bubbly and golden.\nGarnish with fresh basil leaves if desired."
  },
  {
    "Recipe Name": "Chocolate Brownies",
    "Category": "Desserts",
    "Calories": "276 calories per brownie",
    "Ingredients": "1 cup (2 sticks) unsalted butter\n2 cups granulated sugar\n4 large eggs\n2 teaspoons vanilla extract\n1 cup all-purpose flour\n1/2 cup cocoa powder\n1/2 teaspoon salt\n1/2 cup chocolate chips (optional)",
    "Directions": "Preheat your oven to 350°F (175°C) and grease a 9x13-inch baking pan.\nIn a saucepan, melt the butter over low heat. Remove from heat and stir in the sugar until well combined.\nBeat in the eggs one at a time, then stir in the vanilla extract.\nIn a separate bowl, whisk together the flour, cocoa powder, and salt. Gradually add this dry mixture to the wet ingredients, stirring until well combined.\nIf desired, fold in the chocolate chips.\nPour the brownie batter into the prepared baking pan and spread it evenly.\nBake in the preheated oven for 25-30 minutes or until a toothpick inserted into the center comes out with a few moist crumbs (not wet batter).\nAllow the brownies to cool before cutting into squares."
  },
  {
    "Recipe Name": "New York Cheesecake",
    "Category": "Desserts",
    "Calories": "508 calories per slice",
    "Ingredients": "2 cups graham cracker crumbs\n1/2 cup unsalted butter, melted\n4 (8-ounce) packages cream cheese, softened\n1 1/2 cups granulated sugar\n1 teaspoon vanilla extract\n4 large eggs\n1 cup sour cream",
    "Directions": "Preheat oven to 325°F (163°C).\nIn a bowl, combine graham cracker crumbs and melted butter. Press the mixture into the bottom of a springform pan to create the crust.\nIn a large mixing bowl, beat cream cheese, sugar, and vanilla until smooth. Add eggs one at a time, mixing well after each addition. Stir in sour cream.\nPour the cream cheese mixture over the crust in the pan.\nBake for 45-50 minutes, or until the edges are set, and the center is slightly jiggly.\nLet the cheesecake cool to room temperature, then refrigerate for several hours or overnight before serving."
  },
  {
    "Recipe Name": "Apple Pie",
    "Category": "Desserts",
    "Calories": "348 calories per slice",
    "Ingredients": "2 pie crusts (store-bought or homemade)\n6-7 cups sliced apples (e.g., Granny Smith)\n3/4 cup granulated sugar\n1 teaspoon ground cinnamon\n1/4 teaspoon ground nutmeg\n2 tablespoons all-purpose flour",
    "Directions": "Preheat oven to 425°F (220°C).\nIn a large bowl, combine sliced apples, sugar, cinnamon, nutmeg, and flour.\nRoll out one pie crust and place it in a pie dish. Add the apple filling.\nRoll out the second pie crust and place it over the apples. Seal and crimp the edges.\nCut slits in the top crust to allow steam to escape.\nBake for 45-55 minutes, or until the crust is golden and the filling is bubbly.\nLet the pie cool before serving."
  },
  {
    "Recipe Name": "Tiramisu",
    "Category": "Desserts",
    "Calories": "",
    "Ingredients": "1 1/2 cups mascarpone cheese\n4 large eggs, separated\n1 cup granulated sugar\n1 cup brewed espresso or strong coffee, cooled\n1/4 cup coffee liqueur (optional)\nLadyfingers\nUnsweetened cocoa powder",
    "Directions": "In a mixing bowl, beat egg yolks and sugar until creamy. Add mascarpone cheese and mix until smooth.\nIn another bowl, beat egg whites until stiff peaks form. Gently fold them into the mascarpone mixture.\nMix the espresso and coffee liqueur (if using) in a shallow dish.\nQuickly dip ladyfingers into the coffee mixture and layer them in a serving dish.\nSpread half of the mascarpone mixture over the ladyfingers.\nRepeat the ladyfinger and mascarpone layers.\nRefrigerate for several hours or overnight.\nBefore serving, dust with unsweetened cocoa powder."
  },
  {
    "Recipe Name": "Lemon Tart",
    "Category": "Desserts",
    "Calories": "",
    "Ingredients": "1 1/2 cups all-purpose flour\n1/2 cup unsalted butter, cold and cubed\n1/4 cup powdered sugar\n4 large eggs\n1 1/4 cups granulated sugar\n1/2 cup fresh lemon juice\n2 teaspoons lemon zest\n1/4 cup all-purpose flour\nPowdered sugar for dusting",
    "Directions": "In a food processor, combine flour, cold butter, and powdered sugar. Pulse until the mixture resembles coarse crumbs.\nPress the mixture into a tart pan to form the crust. Chill for 30 minutes.\nPreheat oven to 350°F (175°C).\nIn a mixing bowl, whisk together eggs, granulated sugar, lemon juice, lemon zest, and flour until well combined.\nPour the lemon filling into the chilled crust.\nBake for 30-35 minutes or until the tart is set and the edges are lightly golden.\nLet the tart cool to room temperature before dusting with powdered sugar."
  },
  {
    "Recipe Name": "Chocolate Chip Cookies",
    "Category": "Desserts",
    "Calories": "194 calories per cookie",
    "Ingredients": "2 1/4 cups all-purpose flour\n1/2 teaspoon baking soda\n1 cup unsalted butter, room temperature\n1/2 cup granulated sugar\n1 cup packed light-brown sugar\n1 teaspoon salt\n2 teaspoons pure vanilla extract\n2 large eggs\n2 cups semisweet and/or milk chocolate chips",
    "Directions": "Preheat oven to 350°F (175°C).\nIn a mixing bowl, whisk together flour and baking soda. Set aside.\nIn a separate bowl, cream together the butter, granulated sugar, brown sugar, salt, and vanilla extract until smooth.\nBeat in the eggs one at a time, then stir in the flour mixture until just combined.\nFold in the chocolate chips.\nDrop rounded tablespoons of cookie dough onto ungreased baking sheets.\nBake for 9-11 minutes or until the edges are golden but the centers are still soft.\nLet the cookies cool on the baking sheets for a few minutes before transferring them to wire racks to cool completely."
  },
  {
    "Recipe Name": "Carrot Cake",
    "Category": "Desserts",
    "Calories": "381 calories per serving",
    "Ingredients": "2 cups grated carrots\n1 1/2 cups all-purpose flour\n1 1/2 tsp baking powder\n1/2 tsp baking soda\n1/2 tsp salt\n1 tsp ground cinnamon\n1/2 tsp ground nutmeg\n1/2 cup vegetable oil\n1 cup granulated sugar\n2 large eggs\n1 tsp vanilla extract\n1/2 cup crushed pineapple, drained\n1/2 cup chopped walnuts (optional)\nCream cheese frosting",
    "Directions": "Preheat your oven to 350°F (175°C) and grease a 9x9-inch cake pan.\nIn a bowl, mix together the grated carrots, flour, baking powder, baking soda, salt, cinnamon, and nutmeg.\nIn another bowl, beat together the vegetable oil, sugar, eggs, and vanilla until well combined.\nGradually add the dry ingredients to the wet ingredients and mix until a batter forms.\nStir in the crushed pineapple and chopped walnuts (if using).\nPour the batter into the greased cake pan and bake for 25-30 minutes or until a toothpick inserted in the center comes out clean.\nAllow the cake to cool completely before frosting it with cream cheese frosting."
  },
  {
    "Recipe Name": "Panna Cotta",
    "Category": "Desserts",
    "Calories": "351 calories per serving",
    "Ingredients": "2 cups heavy cream\n1/2 cup whole milk\n1/2 cup granulated sugar\n2 tsp vanilla extract\n2 1/4 tsp gelatin\n3 tbsp cold water",
    "Directions": "In a small bowl, sprinkle the gelatin over cold water and let it sit for 5 minutes to bloom.\nIn a saucepan, heat the heavy cream, whole milk, and sugar over medium heat until it's steaming, but do not boil.\nRemove the cream mixture from the heat, and stir in the vanilla extract.\nAdd the bloomed gelatin to the hot cream mixture and stir until fully dissolved.\nPour the mixture into serving glasses or ramekins.\nAllow the panna cotta to cool at room temperature, then refrigerate for at least 4 hours or until set.\nServe chilled with your favorite toppings (e.g., berries, caramel sauce, or chocolate shavings)."
  },
  {
    "Recipe Name": "Banana Bread",
    "Category": "Desserts",
    "Calories": "218 calories per serving",
    "Ingredients": "2-3 ripe bananas, mashed\n1/3 cup melted butter\n1 tsp baking soda\nPinch of salt\n3/4 cup granulated sugar\n1 large egg, beaten\n1 tsp vanilla extract\n1 1/2 cups all-purpose flour",
    "Directions": "Preheat your oven to 350°F (175°C) and grease a 4x8-inch loaf pan.\nIn a mixing bowl, mash the ripe bananas with a fork until smooth.\nStir the melted butter into the mashed bananas.\nMix in the baking soda and salt.\nStir in the sugar, beaten egg, and vanilla extract, and mix until well combined.\nAdd the flour and mix until just incorporated. Do not overmix.\nIf desired, fold in chopped nuts or chocolate chips.\nPour the batter into the greased loaf pan.\nBake for 60-65 minutes or until a toothpick inserted in the center comes out clean.\nAllow the banana bread to cool in the pan for a few minutes before transferring it to a wire rack to cool completely."
  },
  {
    "Recipe Name": "Raspberry Sorbet",
    "Category": "Desserts",
    "Calories": "73 calories per serving",
    "Ingredients": "3 cups frozen raspberries\n1/2 cup granulated sugar\n1/4 cup water\n1 tsp lemon juice",
    "Directions": "In a saucepan, combine the sugar and water. Heat over low heat, stirring until the sugar is completely dissolved. Remove from heat and let it cool.\nPlace the frozen raspberries and lemon juice in a blender or food processor.\nPour the cooled sugar syrup over the raspberries.\nBlend until smooth.\nPour the raspberry mixture into an ice cream maker and churn according to the manufacturer's instructions, usually for about 20-25 minutes.\nTransfer the sorbet to an airtight container and freeze for a few hours to firm it up.\nServe the raspberry sorbet in scoops, garnished with fresh raspberries if desired."
  }
]