[
{"Name": "Christmas pie", "url": "https://www.bbcgoodfood.com/recipes/2793/christmas-pie", "Description": "Combine a few key Christmas flavours here to make a pie that both children and adults will adore", "Author": "Mary Cadogan", "Ingredients": ["2 tbsp olive oil", "knob butter", "1 onion, finely chopped", "500g sausagemeat or skinned sausages", "grated zest of 1 lemon", "100g fresh white breadcrumbs", "85g ready-to-eat dried apricots, chopped", "50g chestnut, canned or vacuum-packed, chopped", "2 tsp chopped fresh or 1tsp dried thyme", "100g cranberries, fresh or frozen", "500g boneless, skinless chicken breasts", "500g pack ready-made shortcrust pastry", "beaten egg, to glaze"], "Method": ["Heat oven to 190C/fan 170C/gas 5. Heat 1 tbsp oil and the butter in a frying pan, then add the onion and fry for 5 mins until softened. Cool slightly. Tip the sausagemeat, lemon zest, breadcrumbs, apricots, chestnuts and thyme into a bowl. Add the onion and cranberries, and mix everything together with your hands, adding plenty of pepper and a little salt.", "Cut each chicken breast into three fillets lengthwise and season all over with salt and pepper. Heat the remaining oil in the frying pan, and fry the chicken fillets quickly until browned, about 6-8 mins.", "Roll out two-thirds of the pastry to line a 20-23cm springform or deep loose-based tart tin. Press in half the sausage mix and spread to level. Then add the chicken pieces in one layer and cover with the rest of the sausage. Press down lightly.", "Roll out the remaining pastry. Brush the edges of the pastry with beaten egg and cover with the pastry lid. Pinch the edges to seal, then trim. Brush the top of the pie with egg, then roll out the trimmings to make holly leaf shapes and berries. Decorate the pie and brush again with egg.", "Set the tin on a baking sheet and bake for 50-60 mins, then cool in the tin for 15 mins. Remove and leave to cool completely. Serve with a winter salad and pickles."]},
{"Name": "Simmer-&-stir Christmas cake", "url": "https://www.bbcgoodfood.com/recipes/1160/simmerandstir-christmas-cake", "Description": "An easy-to-make alternative to traditional Christmas cakes which requires no beating", "Author": "Mary Cadogan", "Ingredients": ["175g butter, chopped", "200g dark muscovado sugar", "750g luxury mixed dried fruit (one that includes mixed peel and glacé cherries)", "finely grated zest and juice of 1 orange", "finely grated zest of 1 lemon", "100ml/3½ fl oz cherry brandy or brandy plus 4tbsp more", "85g macadamia nut", "3 large eggs, lightly beaten", "85g ground almond", "200g plain flour", "½ tsp baking powder", "1 tsp ground mixed spice", "1 tsp ground cinnamon", "¼ tsp ground allspice"], "Method": ["Put the butter, sugar, fruit, zests, juice and 100ml/3½fl oz brandy in a large pan. Bring slowly to the boil, stirring until the butter has melted. Reduce the heat and bubble for 10 minutes, stirring occasionally.", "Remove the pan from the heat and leave to cool for 30 minutes.", "Meanwhile, preheat the oven to 150C/gas 2/ fan 130C and line a 20cm round cake tin. Toast the nuts in a dry frying pan, tossing them until evenly browned, or in the oven for 8-10 minutes - keep an eye on them as they burn easily. When they are cool, chop roughly. Stir the eggs, nuts and ground almonds into the fruit mixture and mix well. Sift the flour, baking powder and spices into the pan. Stir in gently, until there are no traces of flour left.", "Spoon the mixture into the tin and smooth it down evenly - you will find this is easiest with the back of a metal spoon which has been dipped into boiling water.", "Bake for 45 minutes, then turn down the heat to 140C/gas 1/ fan120C and cook for a further 1-1¼ hours (about a further 1¾ hours if you have a gas oven) until the cake is dark golden in appearance and firm to the touch. Cover the top of the cake with foil if it starts to darken too much. To check the cake is done, insert a fine skewer into the centre - if it comes out clean, the cake is cooked.", "Make holes all over the warm cake with a fine skewer and spoon the extra 4tbsp brandy over the holes until it has all soaked in. Leave the cake to cool in the tin. When it's cold, remove it from the tin, peel off the lining paper, then wrap first in baking parchment and then in foil. The cake will keep in a cupboard for up to three months or you can freeze it for six months."]},
{"Name": "Christmas cupcakes", "url": "https://www.bbcgoodfood.com/recipes/72622/christmas-cupcakes", "Description": "These beautiful and classy little cakes make lovely gifts, and kids will enjoy decorating them too", "Author": "Sara Buenfeld", "Ingredients": ["200g dark muscovado sugar", "175g butter, chopped", "700g luxury mixed dried fruit", "50g glacé cherries", "2 tsp grated fresh root ginger", "zest and juice 1 orange", "100ml dark rum, brandy or orange juice", "85g/3oz pecannuts, roughly chopped", "3 large eggs, beaten", "85g ground almond", "200g plain flour", "½ tsp baking powder", "1 tsp mixed spice", "1 tsp cinnamon", "400g pack ready-rolled marzipan(we used Dr Oetker)", "4 tbsp warm apricotjam or shredless marmalade", "500g pack fondant icingsugar", "icing sugar, for dusting", "6 gold and 6 silver muffincases", "6 gold and 6 silver sugared almonds", "snowflake sprinkles"], "Method": ["Tip the sugar, butter, dried fruit, whole cherries, ginger, orange zest and juice into a large pan. Pour over the rum, brandy or juice, then put on the heat and slowly bring to the boil, stirring frequently to melt the butter. Reduce the heat and bubble gently, uncovered for 10 mins, stirring every now and again to make sure the mixture doesn’t catch on the bottom of the pan. Set aside for 30 mins to cool.", "Stir the nuts, eggs and ground almonds into the fruit, then sift in the flour, baking powder and spices. Stir everything together gently but thoroughly. Your batter is ready.", "Heat oven to 150C/130C fan/gas 2. Scoop the cake mix into 12 deep muffin cases (an ice-cream scoop works well), then level tops with a spoon dipped in hot water. Bake for 35-45 mins until golden and just firm to touch. A skewer inserted should come out clean. Cool on a wire rack.", "Unravel the marzipan onto a work surface lightly dusted with icing sugar. Stamp out 12 rounds, 6cm across. Brush the cake tops with apricot jam, top with a marzipan round and press down lightly.", "Make up the fondant icing to a spreading consistency, then swirl on top of each cupcake. Decorate with sugared almonds and snowflakes, then leave to set. Will keep in a tin for 3 weeks."]},
{"Name": "Christmas buns", "url": "https://www.bbcgoodfood.com/recipes/1803633/christmas-buns", "Description": "Paul Hollywood's fruit rolls can be made ahead then heated up before adding a glossy glaze and citrus icing", "Author": "Paul Hollywood", "Ingredients": ["500g strong white flour, plus extra for dusting", "7g sachet fast-action dried yeast", "300ml milk", "40g unsalted butter, softened at room temperature", "1 egg", "vegetable oil, for greasing", "25g unsalted butter, melted", "75g soft brown sugar", "2 tsp ground cinnamon", "100g dried cranberries", "100g chopped dried apricot", "50g caster sugar", "zest 1 lemon", "200g icing sugar"], "Method": ["Put the flour and 1 tsp salt into a large bowl. Make a well in the centre and add the yeast. Meanwhile, warm the milk and butter in a pan until the butter melts and the mixture is lukewarm. Add the milk mixture and egg to the flour mixture and stir until the contents come together as a soft dough (add extra flour if you need to).", "Tip the dough onto a well-floured surface. Knead for 5 mins, adding more flour if necessary, until the dough is smooth, elastic and no longer sticky.", "Lightly oil a bowl with the vegetable oil. Place the dough in the bowl and turn until covered in oil. Cover the bowl with cling film and set aside in a warm place for 1 hr or until doubled in size. Lightly grease a baking sheet and set aside.", "For the filling, knock the dough back to its original size and turn out onto a lightly floured surface. Roll it into a 1cm-thick rectangle. Brush all over with the melted butter, then sprinkle over the sugar, cinnamon and fruit.", "Roll up the dough into a tight cylinder, cut into 9 x 4cm slices and position on the prepared baking sheet, leaving a little space between. Cover with a tea towel and set aside to rise for 30 mins.", "Heat oven to 190C/170C fan/gas 5. Bake the buns for 20-25 mins or until risen and golden brown. Meanwhile, melt the glaze sugar with 4 tbsp water until syrupy.", "Remove from oven and glaze. Set aside to cool on a wire rack. Once cool, mix the zest and icing sugar with about 2 tbsp water to drizzle over the buns. Serve."]},
{"Name": "Christmas cupcakes", "url": "https://www.bbcgoodfood.com/recipes/981634/christmas-cupcakes", "Description": "Made these for the second time today, and I have to say they turned out great! I've got large muffin tins and the mixture made 15 muffins, will definetely make these again at christmas time and decorate festively.", "Author": "Barney Desmazery", "Ingredients": ["280g self-raising flour", "175g golden caster sugar", "175g unsalted butter, very soft", "150g pot fat-free natural yogurt", "1 tsp vanilla extract", "3 eggs", "85g unsalted butter, softened", "1 tsp vanilla extract", "200g icing sugar, sifted", "natural green food colouring(for Christmas trees), sweets, sprinkles and white chocolate stars", "milk and white chocolatebuttons and natural colouring icing pens, available at Asda"], "Method": ["Heat oven to 190C/170 fan/gas 5 and line a 12-hole muffin tin with cake cases. Put all the cake ingredients into a bowl and mix with a whisk until smooth. Spoon the mix into the cases, bake for 25 mins until golden and risen and a skewer comes out clean. Cool on a wire rack.", "For the frosting, beat the butter, vanilla extract and icing sugar until pale and creamy and completely combined. To make snowmen, reindeer and Christmas puddings, first spread the icing over the top of each cake. Then lay the chocolate buttons on top, slicing some buttons into quarters to make ears and hats. Finally, use icing pens for the details. For the Christmas tree, colour the icing with green food colouring and pipe onto the cakes using a star-shaped nozzle, decorate with sweets, sprinkles and white chocolate stars."]},
{"Name": "Christmas slaw", "url": "https://www.bbcgoodfood.com/recipes/890635/christmas-slaw", "Description": "A nutty winter salad which is superhealthy, quick to prepare and finished with a light maple syrup dressing", "Author": "Good Food", "Ingredients": ["2 carrots, halved", "½ white cabbage, shredded", "100g pecans, roughly chopped", "bunch spring onions, sliced", "2 red peppers, deseeded and sliced", "2 tbsp maple syrup", "2 tsp Dijon mustard", "8 tbsp olive oil", "4 tbsp cider vinegar"], "Method": ["Peel strips from the carrots using a vegetable peeler, then mix with the other salad ingredients in a large bowl. Combine all the dressing ingredients in a jam jar, season, then put the lid on and shake well. Toss through the salad when you’re ready to eat it. The salad and dressing will keep separately in the fridge for up to four days."]},
{"Name": "Christmas mess", "url": "https://www.bbcgoodfood.com/recipes/2806664/christmas-mess", "Description": "Delicious and a synch to make! Have made this a couple of times as a dinner party dessert, very pretty as a winter alternative to Eton mess. The fact you use frozen fruits is great, I just used a bog standard pack of frozen mixed berries and added some home made blackberry liqueur. Like other people, I added more cinnamon. Thumbs up!", "Author": "Caroline Hire", "Ingredients": ["600ml double cream", "400g Greek yoghurt", "4 tbsp lemon curd", "1 x 500g bag frozen mixed berries(we used Sainsbury's Black Forest fruits)", "4 tbsp icing sugar", "2 tbsp cassis(optional)", "1 pinch cinnamon", "8 meringuenests"], "Method": ["In a small saucepan gently heat the frozen berries, icing sugar and cinnamon until the sugar has dissolved. Remove from the heat, stir in the cassis, if using, and set aside to cool completely.", "Whip the double cream and Greek yogurt until just holding it’s shape, ripple through the lemon curd. Break the meringue nests into a glass bowl, or 8 individual glasses. Spoon over half the cream, then half the berries. Repeat with the remaining cream and berries. Serve immediately."]},
{"Name": "Christmas brownies", "url": "https://www.bbcgoodfood.com/recipes/christmas-brownies", "Description": "can I made these the day before", "Author": "Miriam Nice", "Ingredients": ["200g unsalted buttercut into cubes, plus extra for greasing", "100g dark chocolate, chopped", "100g milk chocolate, chopped", "3 large eggs", "300g golden caster sugar", "100g plain flour", "50g cocoa powder", "½ tsp mixed spice", "9 sprigs rosemary", "9 glacé cherries", "1 egg white", "2 tbsp caster sugar", "4 amaretti biscuits, crushed", "9 chocolate truffles(we used Lindt lindor)", "edible gold lustre spray", "1-2 tsp icing sugarfor dusting", "few chocolate buttons", "edible silver balls"], "Method": ["Grease and line a 20cm x 20cm brownie tin. Heat oven to 180C/160C fan/gas 4. Put the butter and both types of chocolate in a heat proof bowl and either melt in the microwave (in 30 second bursts, stirring after each) or set over a pan of barely simmering water, stirring every now and then until the chocolate has melted.", "Leave the chocolate and butter mixture to cool a little while you whisk the eggs and caster sugar in a large bowl using electric beaters. Once the mixture is pale, fluffy and looks like it’s roughly doubled in volume, whisk in the melted chocolate. Fold in the flour, cocoa powder and mixed spice until no pockets of flour remain then pour into your prepared tin. Level the top with a spatula and bake for 20-25 mins. The top should look set and shiny but should be a little wobbly if you gently jostle the tin.", "Leave the brownie to cool completely in the tin then chill in the fridge until set. While the brownie cools brush the rosemary sprigs and glacé cherries with egg white, dab off the excess with kitchen paper then dredge in caster sugar until well coated. Leave to dry on a wire rack. Put the chocolate truffles onto a sheet of baking paper or foil then spray with the edible gold lustre.", "Dust the chilled brownie with icing sugar to create a snowy surface and top with amaretti biscuit pieces then poke the crystalised rosemary sprigs into the surface at random intervals (cut the brownie into pieces and dust on icing sugar first, if you like). Nestle a glacé cherry or gold truffle alongside the rosemary sprig then add the buttons and silver balls."]},
{"Name": "Potted salmon rillette", "url": "https://www.bbcgoodfood.com/recipes/potted-salmon-rillette-0", "Description": "This delicious starter is similar to a pâté, made with smoked salmon, cream cheese and horseradish for a kick - serve on crackers or toast", "Author": "Good Food", "Ingredients": ["100g cream cheese", "100g crème fraîche, soured cream, double or whipping cream – or a mixture of all your leftovers", "100g smoked salmontrimmings, half diced, plus extra to decorate (optional)", "2-3 tsp creamed horseradish", "lemonwedge", "few dillsprigs, to decorate (optional)", "melba toast, crackers or toasted rye bread, and a few leaves, to serve"], "Method": ["Put the cream cheese, the leftover creams, 50g salmon, 2 tsp horseradish and a small squeeze of lemon juice in a food processor or blender. Whizz until smooth, then scrape into a mixing bowl. Fold in the remaining salmon, then taste – add another tsp horseradish if you like, plus seasoning if needed. Divide the mixture between 4 small ramekins and chill for at least 2 hrs.", "Before serving, decorate the rillettes with a spiral of salmon or a few dill sprigs, if you like. Add a pot to a plate with a few leaves and some crunchy Melba toast, or similar, and serve."]},
{"Name": "Rich nutmeg ice cream", "url": "https://www.bbcgoodfood.com/recipes/3044/rich-nutmeg-ice-cream", "Description": "This rich ice cream is the perfect way to complement your Christmas pudding", "Author": "Jane Hornby", "Ingredients": ["284ml pot double cream", "200ml full-cream milk", "6 egg yolks", "50g sugar", "1 tsp freshly-grated nutmeg"], "Method": ["Heat the double cream and the full-cream milk in a pan until just starting to boil.", "Meanwhile whisk the egg yolks and sugar in a large bowl. When milk and cream mix is ready, steadily pour it over the yolks, whisking continuously.", "Pour back into a clean pan, then heat gently, stirring, for about 10 mins until the mix thickens enough to coat the back of a spoon. Strain custard through a sieve into another large bowl, stir in the freshly-grated nutmeg, then cool.", "Churn in an ice cream machine or pour into a freezer-proof container, then freeze for about 1½ hrs until frozen around the edges. Stir the frozen edges into the mix, then repeat this twice more or until the ice cream is smooth and thick. Leave for at least 4 hrs to freeze before serving with Sticky orange & marsala pudding (see link, right)."]},
{"Name": "Herby slashed roasties", "url": "https://www.bbcgoodfood.com/recipes/2712/herby-slashed-roasties", "Description": "A much-less-fiddly version of classic Hasselback potatoes which are healthy yet totally tasty too", "Author": "Jane Hornby", "Ingredients": ["2¼kg floury potatoes, such as Maris Piper, unpeeled", "10 small bay leaves", "handful thyme sprigs", "2 tbsp butter", "light olive oil"], "Method": ["Bring a large saucepan of water to the boil and heat oven to 200C/fan 180C/gas 6. Cut the potatoes into halves or quarters depending on their size. Tip into the pan, allow the heat to come back up, then boil for 6-10 mins until just starting to soften around the edges. Drain in a colander and return to the pan. With the lid on, shake the potatoes until the edges fluff up.", "Leave the potatoes until cool enough to handle. Slash half the chunks once with a small knife and stuff alternately with bay or thyme.", "Heat the butter and oil in a large roasting pan either in the oven or on the hob until the butter turns golden. Carefully tip in the potatoes and gently turn in the fat (tongs are best for this). Sprinkle with sea salt and black pepper to taste and roast for 1-1¼ hrs until crisp and golden, turning halfway through."]},
{"Name": "Coconut bauble truffles", "url": "https://www.bbcgoodfood.com/recipes/coconut-bauble-truffles", "Description": "Make these colourful truffles from leftover Madeira cake, dried apricots and desiccated coconut - perfect as an edible gift to make with kids", "Author": "Sarah Cook", "Ingredients": ["250g madeira cake", "85g ready-to-eat dried apricots, finely chopped", "25g desiccated coconut", "125ml light condensed milk", "140g desiccated coconut", "different food colourings, we used yellow, pink, blue and purple"], "Method": ["In a big mixing bowl, crumble the cake with your fingers – try to get the bits as small as possible.", "Tip in the apricots and coconut. Using your hands again, mix together with the cake crumbs. Use a wooden spoon to stir in the condensed milk. After you’ve mixed it in a bit, use your fingers to pull off any bits stuck to the spoon. Squidge everything together with your hands until it is well mixed and all the cake crumbs are sticky. Rub your hands together over the bowl so any bits that are stuck drop off.", "Line some trays that fit in your fridge with baking parchment. Roll the sticky cake mixture into small balls (about the size of a conker or gobstopper) between your hands. Line them up on the trays, then put them in the fridge while you get the decorations ready.", "Decide on how many different food colourings you are going to use, then split the coconut into the same number of piles. Put each pile of coconut into a plastic sandwich bag, add a few drops of food colouring to each, and tie a knot in the top. Shake the bags and scrunch between your fingers until all the coconut is coloured – if it’s not bright enough, open the bag and add a few more drops of colouring.", "Open all the bags of coloured coconut and take the truffles from the fridge. Put 1 tbsp of water in a small bowl and lightly coat each truffle in it so the coconut can stick to the outside of each bauble.", "One by one, drop each truffle into one of your bags. Shake it and roll it around until the outside is covered in coconut. Carefully put each truffle back onto the trays and chill for at least another 2 hrs until they are really cold and firm.", "If you like, put some of the truffles in gift bags or boxes and tie with ribbons to give as presents. Will keep in the fridge for up to 1 week."]},
{"Name": "Mustard butter-basted roast turkey with bacon", "url": "https://www.bbcgoodfood.com/recipes/mustard-butter-basted-roast-turkey-bacon", "Description": "Ensure juicy meat by inserting streaky bacon under the skin of your big bird. A tangy mustard baste creates an extra tasty gravy", "Author": "Sara Buenfeld", "Ingredients": ["5-5½ kg oven-ready turkey, neck and giblets removed (save them to make stock, if you like)", "250g pack dry-cured smoked streaky bacon(about 12 rashers)", "a little mustard(optional)", "drizzle of olive oil", "sea saltflakes", "1 onion, quartered", "1 large thyme sprig", "a few bay leaves", "glass of dry white wine", "bay leaves and chopped thyme, for scattering", "85g butter, softened", "1 tbsp wholegrain mustard", "1 tsp English mustard", "1 tbsp fresh thyme leaves"], "Method": ["Weigh your turkey and calculate the cooking time by allowing 40 mins per kg for the first 4kg, then 45 mins for every kg of turkey over that weight. As a guide, a turkey this size should take 3½-4 hrs plus 30-45 mins resting time.", "To make the mustard butter, beat the butter with the mustards, thyme and some ground black pepper until soft and well mixed.", "Gently push your fingers under the skin of the turkey, starting from the neck, until you can push your whole hand in down the length of the breast – take care not to tear the skin. Spread the butter under the skin so that it covers the breasts. Lay the streaky bacon on your work surface in 2 rectangles of 6 overlapping rashers (for extra flavour, you can brush the bacon with a little wholegrain or English mustard first), and carefully push each rectangle of bacon under the skin to cover and protect each breast. This can be done the night before, but take out of the fridge for 1 hr before roasting so that it comes back to room temperature.", "On the day, heat oven to 180C/160C fan/gas 4. Lift the turkey into a roasting tin, massage the olive oil into the skin and season well with flaky salt and pepper. Put the onion, thyme and bay inside the cavity of the turkey, then pour in the wine. Cover the tin loosely with foil and roast for the calculated cooking time. For the final 30 mins, remove the foil and pour off all of the cooking juices (use for the gravy; recipe in 'goes well with'). Increase the oven to 200C/180C fan/gas 6 and roast for 30 mins more until the turkey is golden and the juices that run out of the thigh are clear, with no sign of pink, when pierced with a skewer. Leave to rest on a warm platter covered with foil and tea towels – it will keep like this for up to 45 mins.", "To serve, carve the turkey and arrange the meat on a hot platter with a little of the hot gravy poured over, or bring the whole turkey to the table garnished with herbs. To fill the platter, you could surround the turkey with potatoes, if you like. Any leftover meat can be frozen in the gravy."]},
{"Name": "Lobster muffins with poached egg, caviar, spinach & hollandaise", "url": "https://www.bbcgoodfood.com/recipes/lobster-muffins-poached-egg-caviar-spinach-hollandaise", "Description": "Turn Eggs Benedict into a gourmet treat, perfect for a celebration breakfast or indulgent brunch - use shop bought muffins to save time", "Author": "Tom Kerridge", "Ingredients": ["½ lobster, about 300g meat (see tip, top right)", "25g butter, for reheating the lobster", "2 very fresh eggs", "1 tsp white wine vinegar", "large knob of butter", "100g bag baby spinach, washed", "whole nutmeg", "2 tsp Avruga caviar", "350g strong white bread flour", "7g sachet fast-action dried yeast", "175ml warm milk", "1 egg, beaten", "fine polenta or semolina, for dusting", "50ml white wine", "100ml white wine vinegar", "1 shallot, finely chopped", "½ small bunch tarragon", "¼ tsp whole black peppercorns", "1 large egg yolk", "1 tbsp double cream", "125g butter, melted", "cayenne pepper, to taste", "1-2 tbsp lemon juice, to taste"], "Method": ["First make the muffins. Mix together the flour, yeast and 3/4 tsp salt in a food mixer with the dough hook, or in a large bowl if making by hand. Add the milk and egg, and mix to a dough. Leave the mixture in the machine with the motor running and knead the mix for 5-6 mins until it becomes elastic and smooth, or for 10-15 mins by hand. Place the dough in a bowl, cover with cling film and place in a warm spot to prove.", "When it has doubled in size, punch the dough down with your hand and turn out. Dust your work surface and a baking tray with the polenta or semolina. Roll out the dough until 2.5cm thick and cut out muffins using a 9cm straight-edged cutter – you should have about 4 muffins. Transfer them to the tray, cover with cling film and leave to prove for 20-25 mins or until doubled in size.", "Put a piece of baking parchment in a non-stick frying pan and put the pan on a low heat. Gently transfer the muffins to the pan and cook them in batches for 5-6 mins each side until they are toasted and brown. Remove from the pan and leave to cool on a wire rack. When cool, these freeze very well in freezer bags – then simply toast them from frozen. Keep 2 out for your lobster.", "To make the hollandaise, put the wine, vinegar, shallot, tarragon and peppercorns in a small pan and bring to the boil. Simmer for 8-10 mins or until the mix is reduced to one-third of its original volume. Remove from the heat and leave to cool. Meanwhile, fill a pan one-third with water, bring to the boil, then reduce to a simmer. Strain the infused vinegar mixture into a mixing bowl, add the egg yolk and a large splash of water. Place the bowl over the top of the pan of simmering water (but not touching the water) and whisk. The sauce will lighten in colour and fluff up – this is called a sabayon. Do not overcook or it will look like scrambled eggs. When it is fluffy but firm, add the splash of double cream, then slowly pour in the melted butter – not too quickly – imagine you are making mayonnaise, drizzling in a small amount at a time. When all the butter has been incorporated, season with salt, cayenne and lemon juice. Pass the hollandaise through a fine sieve into a bowl. Cover with cling film and keep warm until needed.", "Prepare the lobster. Twist the claws and pull the tail off the lobster, then bash the claws with a rolling pin to crack the shell and reveal the meat. Remove the shell from the tail, then cut the tail in half lengthways and remove the intestine. You should now have half a tail and a claw per person. Remove the meat from the shell. To reheat the meat, melt the butter with 2 tbsp water in a medium saucepan. Add the lobster meat and warm over a gentle heat.", "To poach the eggs, bring a small pan of water to the boil and add a splash of white wine vinegar. Spin the water around with a slotted spoon and crack in the eggs – they must be very fresh. Turn off the heat and leave them to poach for 2-3 mins until set but still soft.", "Meanwhile, melt the knob of butter in a pan. Add the spinach and stir until it starts to wilt. Season and grate over a little nutmeg. Remove from the heat and drain the spinach on kitchen paper. To serve, halve 1 muffin and lightly toast to warm through. Put half a muffin on each plate and top with the spinach, then add the portioned warm lobster. Place a poached egg on top, then spoon over the hollandaise and a dollop of caviar."]},
{"Name": "Ham & watercress salad with clementine dressing", "url": "https://www.bbcgoodfood.com/recipes/ham-watercress-salad-clementine-dressing", "Description": "Use up leftover festive ingredients such as ham, hazelnuts, cranberries and clementines in this light salad - perfect after a week of indulgence", "Author": "Emily Kydd", "Ingredients": ["250g pouch ready-to-eat mixed grains", "280g leftover ham, shredded or cut into chunks", "100g bag watercress", "1 small fennel bulb, thinly sliced", "50g hazelnuts, toasted and roughly chopped", "small bunch parsley, roughly chopped", "1½ tbsp dried cranberries, roughly chopped", "2 tbsp extra virgin olive oil", "zest 1 clementineand juice of 2", "2½ tsp Dijon mustard", "good drizzle of clear honey"], "Method": ["For the dressing, put all the ingredients in a jar, along with some seasoning, pop on the lid and give it a really good shake.", "Tip the grains into a large bowl and toss through the ham, watercress, fennel, hazelnuts and parsley. Just before serving, pour over the dressing and gently toss to combine. Transfer to a serving platter and scatter over the dried cranberries."]},
{"Name": "Bramley apple sauce", "url": "https://www.bbcgoodfood.com/recipes/8766/bramley-apple-sauce", "Description": "A great accompaniment to rich meats such as goose or pork", "Author": "Barney Desmazery", "Ingredients": ["3 Bramley apples, peeled, cored and sliced", "50g caster sugar", "50g butter"], "Method": ["Tip all the ingredients into a pan, then cover with a lid. Place the pan on a low heat, stirring occasionally, for about 15 mins until the apples break down into a purée. Stir to knock out any lumps, then tip into a serving dish."]},
{"Name": "Raspberry cranachan trifle", "url": "https://www.bbcgoodfood.com/recipes/8785/raspberry-cranachan-trifle", "Description": "A twist on the Scottish classic, with crunchy flapjack-style toasted oats", "Author": "Good Food", "Ingredients": ["568ml pot double cream", "284ml pot double cream", "250g tub mascarpone", "140g icing sugar, sifted, plus extra", "6 tbsp Scottish whisky", "1kg frozen raspberries, defrosted", "140g butter", "4 tbsp honey(preferably Scottish heather)", "200g whole jumbo porridge oats", "100g golden caster sugar", "100g hazelnut, roughly chopped", "85g plain flour"], "Method": ["First, make the crunchy oats. Heat oven to 180C/fan 160C/gas 4. Melt the butter and honey in a large saucepan, then stir in the other ingredients until everything is well coated. Spread out on a baking sheet, then bake for 20 mins until crisp. Cool, crumble into pieces, then set aside. Can be stored in an airtight container for up to 3 days.", "For the whisky cream, beat both pots of double cream with the mascarpone, icing sugar and whisky until it is smooth and holds soft peaks. In a separate bowl, stir a couple tbsps icing sugar into the raspberries to taste.", "To assemble, spoon some raspberries in the bottom of a glass bowl, followed by a layer of cream and a layer of oats. Repeat 2-3 times, depending on your bowl size, saving the final layer of oats to scatter over before serving with a dusting of icing sugar."]},
{"Name": "Squidgy chocolate pear pudding", "url": "https://www.bbcgoodfood.com/recipes/squidgy-chocolate-pear-pudding", "Description": "When you don't have much time, but you want (need) something sweet.", "Author": "Justine Pattison", "Ingredients": ["200g butter, plus extra for greasing", "300g golden caster sugar", "4 large eggs", "75g plain flour", "50g cocoa powder", "410g can pearhalves in juice, drained", "100g plain dark chocolate(70% cocoa solids)", "25g flaked almonds(optional)", "creamor ice cream, to serve"], "Method": ["Heat oven to 190C/170C fan/gas 5. Lightly grease a roughly 20 x 30cm shallow ovenproof dish. Put the butter in a large saucepan and place over a low heat until just melted. Remove the butter from the heat and stir in the sugar until well combined.", "Whisk the eggs together in a large bowl. Gradually add the eggs to the butter and sugar, beating well with a wooden spoon in between each addition. Sift the flour and cocoa powder on top of the egg mixture, then beat hard with a wooden spoon until thoroughly combined.", "Pour into the prepared tin or dish and nestle the pears into the chocolate batter. Put the chocolate on a board and cut into chunky pieces roughly 1.5cm with a large knife. Scatter the chocolate pieces over the batter and sprinkle with almonds, if you like. Can be frozen at this stage.", "Bake in the centre of the oven for 30 mins or until the mixture is crusty on the surface and lightly cooked inside. Do not allow to overcook, as the cake will become spongy rather than gooey in the centre. Serve warm with cream or ice cream"]},
{"Name": "Festive squash jalousie", "url": "https://www.bbcgoodfood.com/recipes/1016636/festive-squash-jalousie", "Description": "Perfect for a veggie Christmas Day centrepiece, this easy pie tastes great with all the traditional trimmings", "Author": "Good Food", "Ingredients": ["1 large butternut squash, chopped into chunks", "4 garlic cloves, unpeeled and bashed", "sprig rosemary, leaves stripped and chopped", "few sprigs thyme, leaves stripped", "3 tbsp olive oil", "1 onion, chopped", "1 large field mushroom, chopped", "125g pack cooked chestnut, broken into large pieces", "2 tbsp chopped parsley", "1 tbsp chopped sage", "250g tub mascarpone", "1 tbsp grated parmesan, Pecorino or vegetarian alternative", "pinch freshly grated nutmeg", "500g pack puff pastry", "1 egg, beaten"], "Method": ["Heat oven to 200C/180C fan/gas 6. Toss the squash in a roasting tin with the garlic, rosemary and thyme leaves. Drizzle with 2 tbsp oil and season well. Roast for 40 mins or until soft and starting to brown. Remove and squeeze the garlic out of its skin, mash and gently mix with the squash, than set aside to cool.", "Heat remaining oil in a small pan and fry the onion until soft and lightly golden. Add the mushroom and fry for 3-4 mins more. Remove from heat and set aside. In a large bowl, mix the chestnuts, herbs, cheese, and nutmeg. Stir in mushrooms and squash mixture, taking care not to break up the squash too much. Season well.", "Roll a third of the pastry into a rectangle measuring 12 x 30cm. Place on a baking tray and pierce all over with a fork, brush with beaten egg and bake for 10 mins until lightly golden and slightly risen.", "Roll out the remaining two-thirds to a rectangle slightly larger than the base then, using a sharp knife, slash diagonally. Pile the filling onto the partly-cooked base leaving a 1cm border. Brush the border with a little beaten egg and carefully lay the uncooked pastry on top, pressing down the edges to seal. Glaze top with a little more egg and bake for 30-35 mins until the pastry is golden, risen and cooked through."]},
{"Name": "Pork & parsnip cobbler", "url": "https://www.bbcgoodfood.com/recipes/1209/pork-and-parsnip-cobbler", "Description": "Sweet parsnips work well with pork in this one pot autumnal warmer – it really needs little or no accompaniment", "Author": "Tony Tobin", "Ingredients": ["6 tbsp vegetable oil", "900g diced pork", "2 small onions, finely sliced", "1 tbsp plain flour", "2 celery sticks, finely chopped", "225g ready-to-eat dried apricot", "finely grated zest 1 lemon", "finely grated zest 1 orange", "2 Cox's apples, peeled and chopped", "3 garlic cloves, crushed", "2 tsp each finely chopped fresh thyme, rosemary and sage", "good pinch of curry powder", "½ tsp ground fennel seed", "½ bottle red wine", "600ml vegetable stock", "650g parsnip", "200g self-raising flour", "85g shredded suet", "50g chilled butter, grated", "3 tbsp chopped fresh parsley", "finely grated zest and juice of 1 lemon", "beaten egg, to glaze"], "Method": ["For the filling, heat 2 tablespoons of oil in a large pan and fry the pork in small batches for 4-5 minutes until just browned, then remove with a slotted spoon and set aside. Add the onions to the pan and fry for 5-6 minutes until soft and golden. Return the pork to the pan and sprinkle in the flour. Cook for 1 minute, stirring well.", "Add the celery, apricots, lemon and orange zest, apples, garlic, herbs and spices. Pour in the wine and stock and bring to simmering point, then cover and gently cook for 11⁄4 hours or until the pork is tender. Remove from the heat.", "Meanwhile, preheat the oven to 200C/Gas 6/fan oven 180C. Peel and cut the parsnips into 2.5cm/1in dice. Put the remaining oil in a roasting tin and put in the oven for 5 minutes until hot. Tip the parsnip chunks into the roasting tin and coat in the hot oil. Roast in the oven for 30 minutes until cooked through and golden brown. Drain and set aside. When the pork is tender, stir in the parsnips. Spoon into a 2 litre/31⁄2 pint ovenproof dish and leave to cool completely.", "For the cobbler crust, sift the flour and season. Add the suet, butter and parsley and lightly mix in with a fork. Make a well in the centre, then add the lemon zest and juice and gently bring together to make a soft and pliable dough. If it is too dry, add a little cold water, but don’t knead the dough or it will become tough. Reduce the temperature to 180C/Gas 4/fan oven 160C.", "Roll out the dough on a lightly floured surface to about 5mm/1⁄4in thick. Cut the dough into rounds using a 7.5cm/3in pastry cutter. Re-roll the trimmings and cut out more rounds until all the dough is used up. Arrange the circles of dough so that they slightly overlap on top.", "Brush the dough with beaten egg and bake in the oven for 45 minutes until the crust is golden."]},
{"Name": "Chocolate & almond marbled bundt cake", "url": "https://www.bbcgoodfood.com/recipes/chocolate-almond-marbled-bundt-cake", "Description": "Great British Bake Off's Ruby Tandoh creates a two-tone decorative sponge ring. Pick a patterned bundt cake tin for an extra-special finish", "Author": "Ruby Tandoh", "Ingredients": ["180g butter, softened, plus extra for greasing", "225g caster sugar", "¾ tsp almond extract", "2 tsp baking powder", "180g plain flour", "75g ground almond", "3 large eggs", "2 tbsp milk", "3 tbsp cocoa powdermixed with 3 tbsp hot water to make a paste", "100g dark chocolate chip", "30g icing sugar, to dust", "1½ l (or bigger) bundt cake tin"], "Method": ["Heat the oven to 180C/160C fan/gas 4. Thoroughly brush a 1.5 litre bundt tin with melted butter.", "Cream the butter and sugar together until light and fluffy. Stir in the almond extract.", "Mix together the baking powder, flour and ground almonds. Beat in one egg at a time, adding a spoonful of the flour mixture in between. Repeat until all three eggs have been added, then fold in the remaining flour mixture and stir in the milk.", "Spoon half of the cake batter into a separate bowl and mix in the cocoa paste. Add the chocolate chips to the other half of the mixture. Add spoonfuls of each of the batters alternately to the tin and drag the handle of a teaspoon through the mixture to create a marbled effect.", "Bake for around 40 minutes and then test the cake to see if a skewer inserted into the deepest part comes out clean. The cake will take 40 - 50 mins, depending on the proportions of your bundt tin.", "Let the cake cool in the tin for 10 minutes before turning out onto a cooling rack. Once cooled, dust the cake with a little icing sugar."]},
{"Name": "Beetroot & red onion tarte tatin", "url": "https://www.bbcgoodfood.com/recipes/beetroot-red-onion-tarte-tatin", "Description": "My husband made this for our anniversary dinner. It was delicious! Probably the best vegan recipe I’ve eaten (so far!)", "Author": "Elena Silcock", "Ingredients": ["400g beetroot, cut into wedges", "1 red onion, cut into wedges", "3 tbsp olive oil", "2 tbsp rice wine vinegar", "2 tbsp soft brown sugar", "2 star anise", "flour, for rolling", "500g block puff pastry(we used vegan Jus-Rol)", "1 orange, zested", "peppery green salad, to serve"], "Method": ["Heat oven to 200C/180C fan/gas 6. In a bowl, toss the beetroot and onion in 2 tbsp of the oil, the vinegar and sugar. Add the star anise and season well. Heat the rest of the oil in a large, ovenproof ", ", then nestle in the veg so that they cover the surface of the pan. Cover with foil and cook in the oven for 45 mins.", "On a well-floured surface, roll the pastry to a thickness of 0.5cm and cut out a circle the same size as your frying pan. Carefully take the pan out of the oven, remove the foil and wiggle the beets and onion around in the pan to make a compact layer. Put the pastry on top, tucking it in all around the edges, then return the pan to the oven and bake for 35 mins or until the pastry has puffed up and is a deep golden brown.", "Slide a palate knife around the edge of the tart, then put a plate on top of the pastry, serving side down. Flip the pan over to turn the tart out onto the plate – be careful not to burn yourself with the handle. Top with the orange zest and a sprinkle of sea salt, then serve with a peppery salad on the side."]},
{"Name": "Slow-cooked duck legs in Port with celeriac gratin", "url": "https://www.bbcgoodfood.com/recipes/2778661/slowcooked-duck-legs-in-port-with-celeriac-gratin", "Description": "A cross between confit and a casserole, this slow-braised duck dish is served with a dauphinoise-like potato bake", "Author": "James Martin", "Ingredients": ["2 duck legs", "2 carrots, roughly chopped", "1 small onion, roughly chopped", "1 tbsp plain flour", "1 bay leaf", "1 star anise", "2 cloves", "2 strips orangeskin (with a potato peeler)", "150ml port", "500ml chicken stock", "100ml milk", "100ml double cream", "1 garlic clove, squashed", "1 rosemarysprig", "25g butter, plus extra for greasing", "¼ small celeriac(about 100g), quartered and thinly sliced", "1 small potato, thinly sliced", "grated parmesan, for sprinkling", "seasonal vegetables, to serve"], "Method": ["Heat oven to 160C/140C fan/gas 3. Put the duck legs in a flameproof casserole set over a medium heat. Brown all over, then remove from the casserole and set aside. Pour off all but 1 tbsp of the fat, leave more fat in the pan if you are doubling or tripling (save the drained fat for your Christmas roasties). Add the carrots and onion to the casserole and cook for 5-10 mins or until starting to caramelise. Stir in the flour and cook for 1 min more. Return the duck along with the remaining ingredients. Bring to a simmer, then cover with a lid and put in the oven for 2 hrs.", "Meanwhile, prepare the gratin. Put the milk, cream, garlic and rosemary in a pan set over a low heat. Bring to a gentle simmer for 5 mins, then remove from the heat and leave to infuse for 30 mins. Grease 2 ramekins (about 8cm diameter, 5cm deep). Arrange the celeriac and potato slices in the ramekins, seasoning the layers as you go. Remove the garlic and rosemary from the milk, pour over the veg, then dot with butter. Cover tightly with foil and bake with the duck for 1½ hrs.", "Once cooked, remove the duck and gratins from the oven. ", ". Increase oven to 220C/200C fan/gas 7. Put a heavy can on top of each foil-wrapped gratin and stand for 15-20 mins, or chill like this until needed. Once pressed, turn the gratins out onto a baking tray, sprinkle with a little Parmesan and bake for 20 mins until golden.", "Meanwhile, remove the duck legs from the casserole, strain the cooking liquid into a clean pan and bring to a rapid boil. Reduce the sauce by half until thickened and glossy. Add the duck legs and heat through. Put a duck leg on each plate with a little sauce spooned over the top. Serve with the gratins and seasonal veg."]},
{"Name": "Mint chocolate truffles", "url": "https://www.bbcgoodfood.com/recipes/980637/mint-chocolate-truffles", "Description": "Almost perfect but everybody agreed that it needs more peppermint!", "Author": "Good Food", "Ingredients": ["100ml double cream", "200g milk chocolate, broken into pieces", "¼ tsp peppermint essence(we used Sainsbury's)", "icing sugar, for rolling"], "Method": ["Bring the cream just to the boil in a pan. Turn off the heat and stir in the chocolate. Stir until melted, then add the peppermint. Cool, then chill until the mixture is solid, about 2-3 hrs.", "Scoop out teaspoons of the mixture and roll into small walnut-size balls with your hands, then roll in icing sugar. "]},
{"Name": "Quick cheese straws", "url": "https://www.bbcgoodfood.com/recipes/2413/quick-cheese-straws", "Description": "Delicious cheesy sticks, perfect for dipping, just as good on their own - ready in under 20 minutes.", "Author": "Emma Lewis", "Ingredients": ["350g pack ready-rolled puff pastry", "four handfuls grated parmesan(or vegetarian alternative)", "handful flour, to roll pastry on"], "Method": ["heat oven to 220c/fan 200c/gas 7. Unroll a puff pastry, scatter over a couple of handfuls of grated Parmesan, then fold in half. On a lightly floured surface, roll out to the thickness of a £1 coin. Cut into 1cm strips, then twist the strips 3-4 times. Lay on a baking sheet, scatter over more cheese and bake for 12 mins, or until golden. Leave to cool, then keep in an airtight container for up to 2 days. As these cheese straws are very delicate, roll them in kitchen paper before packing into a plastic container."]},
{"Name": "Beetroot & squash Wellingtons with kale pesto", "url": "https://www.bbcgoodfood.com/recipes/beetroot-squash-wellingtons-kale-pesto", "Description": "My lovely mother in law cooked this as part of a vegan Christmas for us all (despite my husband and I being the only vegans!). It was stunning. So festive, flavourful and satisfying. Just as good reheated in the oven the next day, with bubble and squeak.", "Author": "Sophie Godwin", "Ingredients": ["1 red onion, cut into 8 wedges", "250g raw beetroot, peeled and cut into small chunks", "½ butternut squash, peeled and cut into small chunks", "4 fat garlic cloves, unpeeled", "6 tbsp olive oil", "1 tbsp picked thyme leaves, plus extra for sprinkling", "1 tbsp sumac, plus extra for sprinkling", "250g pouch ready-to-eat Puy lentils", "180g pack whole cooked chestnuts, roughly chopped", "100g kale", "½ lemon, juiced", "2 x 320g packs ready-rolled puff pastrysuitable for vegans (we used Jus-Rol)", "2 tbsp almond milk"], "Method": ["Heat oven to 190C/170C fan/ gas 5. Toss the onion, beetroot, squash and garlic in a roasting tin with 2 tbsp olive oil, the thyme leaves, sumac and some seasoning. Roast for 45 mins until the vegetables are tender but still retain their shape, then stir in the lentils and half the chestnuts. Squeeze the garlic cloves from their skins, reserve half and squash the other two into the lentil mixture. Leave to cool completely.", "Bring a large pan of salted water to the boil, tip in the kale, cook for 1 min until wilted, then drain and run under cold water until cool. Squeeze all the water from the kale, then put it in the small bowl of a food processor along with the reserved garlic cloves, chestnuts, the lemon juice, olive oil and some seasoning. Blitz to a thick pesto, and season to taste.", "On a lightly floured surface, unravel the sheets of puff pastry. Cut each sheet into three widthways so that you have six strips in total then divide the kale pesto between these, followed by the roasted veg and lentils, heaping the mixture on top of the pesto and leaving one side free of filling so that it is easier to roll. Brush all the borders with half the milk, fold over the ends, then carefully roll the pastry lengthways to completely encase the filling into a roll. Place your six individual Wellingtons on a baking tray lined with baking parchment and chill for at least 1 hr, or cover with cling film and leave overnight. ", "To bake from chilled, heat oven to 190 C/170 C fan/gas 3 and line a baking tray with parchment.", "Brush the top of each Wellington with the remaining milk and sprinkle with a little sumac, then bake for 30 mins from chilled or 45 mins from frozen until crisp and golden. Scatter over extra thyme and some flaky sea salt and serve."]},
{"Name": "Mulled wine brownies", "url": "https://www.bbcgoodfood.com/recipes/mulled-wine-brownie", "Description": "Tried these earlier this week and they were divine. It was my first time making brownies and I was a little worried with the process. They came out great - I did keep them in my gas oven for 25 minutes. They were floury and light whilst still hot and became more gooey as they cooled. I received a lot of compliments over them and am making them again later this week.", "Author": "Sophie Godwin", "Ingredients": ["100g dark chocolate", "150g unsalted butter", "200g light brown muscovado sugar", "1 large eggand 1 egg yolk", "100ml red wine", "50g cocoa powder", "100g plain flour", "pinch of nutmegand ground cloves", "¼ tsp each cinnamonand ginger"], "Method": ["Heat the oven to 180C/160C fan/gas 4, butter and line the base of a 20cm x 20cm brownie tin with parchment paper. Melt the chocolate in the microwave or in a glass bowl over a pan of simmering water.", "Mix the flour and cocoa powder together with the spices and a pinch of salt - set aside. Using an electric ", ", beat the butter and sugar together until super light and fluffy then whisk in the egg and yolk.", "Pour in melted chocolate, wine and flour mixture and whisk until just combined.", "Pour the batter into tin and bake for 15 mins until just set, don’t worry if there is a slight wobble in the centre, it will set up as they cool. Put into the fridge to firm up."]},
{"Name": "Creamy bread & onion sauce", "url": "https://www.bbcgoodfood.com/recipes/3040/creamy-bread-and-onion-sauce", "Description": "Sara Buenfeld's creamy sauce will make a tasty addition to your Christmas table", "Author": "Sara Buenfeld", "Ingredients": ["85g butter", "2 onions, sliced", "2 fresh bay leaves, plus extra to serve", "600ml whole milk", "7 cloves", "140g crustless white bread", "142ml pot double cream"], "Method": ["Heat the butter in a pan, add the onions and bay leaves, then gently fry with the lid on for 10 mins until soft, but not coloured.", "Add milk and cloves, then simmer gently, uncovered, for 30 mins, stirring occasionally.", "Remove bay and cloves, then tip everything into a processor and blitz with two-thirds of the bread until smooth. Chill for up to two days. To serve, tip the cream into a pan, add the sauce, then stir until mixed. Tear in the remaining bread. Add a little milk if necessary to thin the consistency. Season and serve warm."]},
{"Name": "Bûche de Noël", "url": "https://www.bbcgoodfood.com/recipes/1799645/bche-de-nol", "Description": "Paul Hollywood's sumptuous chocolate, raspberry and cream sponge falls somewhere between a Yule log and Swiss roll. Add a drop of Drambuie for a cheeky adult twist", "Author": "Paul Hollywood", "Ingredients": ["vegetable oil, for greasing", "150g golden caster sugar", "6 large eggs, separated", "250g good-quality dark chocolate", "icing sugar, for dusting", "400ml double cream, lightly whipped", "150g raspberry, defrosted if frozen", "little Drambuie(optional)", "125g unsalted butter, softened", "225g golden icing sugar", "25g cocoa powder, sifted", "1 tbsp milk"], "Method": ["Heat oven to 220C/200C fan /gas 7. Line a 23 x 33cm Swiss roll tin with baking parchment and oil lightly. Whisk the caster sugar and yolks in a bowl until pale and thick. Melt the chocolate with 4 tbsp cold water in a bowl set over a pan of simmering water. Stir in the sugar mix.", "Whisk egg whites to stiff peaks. Stir a spoonful into the chocolate, then fold in remaining using a large metal spoon. Pour batter into tin and bake for 12-14 mins until risen and just firm. Leave in tin until cold.", "Lay a sheet of baking parchment on a board. With one bold movement, turn the cake onto the paper, then lift off the tin. Carefully peel away the lining paper.", "Spread the whipped cream all over the cake, then scatter over the berries with a dribble of Drambuie, if you like. Starting at the long side opposite you, use the paper to roll the cake towards you. Transfer to a serving dish.", "For the buttercream, beat the butter, then sift in sugar and cocoa. Add milk and mix together. Spread over cake, use a fork to create a log effect, and chill until needed. Decorate, dust with icing sugar and serve."]},
{"Name": "Glazed gammon with parsley & cider sauce", "url": "https://www.bbcgoodfood.com/recipes/2176/glazed-gammon-with-parsley-and-cider-sauce", "Description": "I used a much smaller gammon joint and adjusted the timings accordingly but didn't think the parsley sauce was going to work so made a quick roux/bechamel sauce and added the parsley to that, thinning it slightly with the cider liquid the gammon was cooked in.", "Author": "Nick Nairn", "Ingredients": ["4½ kg joint middle-cut gammon or lightly smoked bacon", "900ml/1½ pints dry cider", "2 onions, quartered", "2 large carrots, halved", "3 fresh bay leaves", "a handful of parsley stalks", "6 cloves", "8 peppercorns", "2 oranges, halved, to garnish", "8 tbsp fine-cut whisky marmalade", "500ml milk", "100g fresh parsley, stalks reserved and leaves chopped", "2 bay leaves", "50g plain flour", "100ml/3½ fl oz double cream"], "Method": ["Instead of soaking the ham overnight to get rid of excess salt, follow my short-cut method.Weigh the joint and calculate the poaching time, allowing 25 minutes for every 450g/1lb, and put the joint in a very large pan. Cover with cold water and bring to the boil, then drain off all the water.", "Pour 600ml/1 pint of the cider into the pan and then pour in enough cold water to cover the joint. Add the onions, carrots, bay leaves, parsley stalks, cloves and peppercorns. Bring slowly to the boil, turn down the heat, then cover and simmer very gently for the calculated time. Allow the joint to cool in the stock (overnight is ideal).", "Preheat the oven to 180C/gas 4/ fan 160C. Lift the joint out of the stock, then strain the stock and measure 500ml/18fl oz. Strip the rind off the joint and score the fat in a diamond pattern. Put the joint in a heavy roasting tin (if it’s wibblywobbly, prop it up with a wad of scrunched-up foil), pour over the remaining cider and braise in the oven for 45 minutes to 1 hour, basting frequently until beginning to brown. If the pan becomes dry, splash in some cider or water to cover the bottom of the tin.", "Meanwhile, start the sauce. Put the milk, parsley stalks and bay leaves into a saucepan, bring to the boil and leave to infuse for as long as you have.", "Remove the joint from the oven and raise the temperature to 200C/gas 6/fan 180C. Put the orange halves around the joint. Melt the marmalade, brush it generously all over the gammon and oranges, then return to the oven for 10 minutes to glaze. Lift the gammon and oranges on to a serving dish, cover and keep warm while you finish the sauce.", "Sprinkle the flour into the roasting tin and scrape and stir around to mix with the juices. Place on the hob and cook for a couple of minutes, stirring, to cook out the flour.Gradually pour in the measured stock and whisk well. Now add the strained infused milk and bring to the boil, then turn down the heat and simmer for 10 minutes. Strain into a clean saucepan, stir in the chopped parsley leaves and cream, then heat through gently and check the seasoning. Pour into a warm jug and serve with the joint."]},
{"Name": "Double chocolate cheesecake", "url": "https://www.bbcgoodfood.com/recipes/8248/double-chocolate-cheesecake", "Description": "Unusually for me , as I have always followed my gut feeling, I followed this recipe verbatim. I was concerned that 10 minutes on the highest oven ( in my case gas 9, preheated for an hour btw) and then 30 minutes on gas 1/4 (my oven only goes to gas1/2 so I adhered to that) was not enough. Still I made it. After 2 hours , in a cooling oven as requested, and then in a fridge, lI was left with a sloppy chocolate tart. It could not be sliced without the sides collapsing. A lot of money on a disappointment.", "Author": "Sara Buenfeld", "Ingredients": ["85g hot melted butter, plus a little extra for greasing", "14 plain chocolate digestives, finely crushed", "3 x 300g packs full-fat Philadelphia cheese, at room temperature", "200g golden caster sugar", "4 tbsp cocoa, sifted", "2 tsp vanilla extract", "3 tbsp Tia Maria", "3 large eggs", "284ml pot soured cream", "100g bar dark coffee chocolate, melted (we used Lindt Excellence Coffee Intense)", "2-3 tbsp milk", "284ml pot double cream", "chocolate curls to decorate (optional)"], "Method": ["Heat oven to 180C/fan 160C/gas 4. Line the base of a 25cm springform tin with baking parchment. Mix the melted butter and biscuit crumbs until well blended, then press firmly onto the base of the tin. Bake for 10 mins.", "Turn oven temperature up to 240C/fan 220C/gas 9. Beat the cream cheese and sugar with an electric whisk until smooth and creamy, then whisk in the cocoa, vanilla, Tia Maria, eggs, soured cream and half the melted chocolate. Stir enough milk into the remaining chocolate to make a sauce consistency, then set aside until ready to decorate the cheesecake.", "Put a little melted butter on some kitchen paper and use it to butter the sides of the cake tin. Pour in the cheese mixture, then smooth the top. Bake for 10 mins, then turn the heat down to 110C/fan 90C/gas ¼ for 25-30 mins. The filling should be set, but with a wobble in the centre. Turn off the oven, open the door a crack, then leave the cheesecake to cool in the oven for 2 hrs. Chill until ready to serve.", "To decorate the cheesecake, carefully remove it from the tin and strip the lining paper from the base. Lightly whip the cream until it just holds its shape, then swirl it on top and drizzle with the reserved chocolate sauce, rippling the sauce through the cream with the end of a spoon. Serve as is or pile with chocolate curls. To make the chocolate curls: run a swivel potato peeler firmly down the smooth back of a slab of chocolate so that curls of chocolate flake away from the bar."]},
{"Name": "Crispy bacon-basted turkey", "url": "https://www.bbcgoodfood.com/recipes/crispy-bacon-basted-turkey", "Description": "Make Christmas dinner even more special with our top tips for the the juiciest meat ever, infused with smoky goodness from an indulgent bacon butter baste", "Author": "Barney Desmazery", "Ingredients": ["5kg-6kg oven-ready turkey, neck and giblets removed and saved for the Sticky port gravy (see 'Goes well with', far right)", "2 thyme sprigs", "1 onion, halved", "1 lemon, halved", "2 bay leaves", "1 garlic bulb, halved", "85g flaky sea salt", "2 tbsp fresh thyme leaves", "1 tsp crushed black pepper", "6 rashers smoked streaky baconor pancetta, chopped into small pieces", "140g butter, softened", "1 tbsp maple syrup"], "Method": ["If you have time the day before, salt the turkey. Make the salt mix by grinding the salt with the thyme leaves and pepper in a spice grinder or with a pestle and mortar. Sit the turkey in a roasting tin and season all over, inside and out, using about two-thirds of the salt. Leave the turkey in the tin, breast-side up, cover with cling film and put in the fridge for up to 24 hrs. If you don’t have time, or there is no room in the fridge, simply prepare the salt and season the turkey generously before roasting.", "To make the bacon butter, gently cook the bacon in a dry frying pan for about 10 mins, stirring occasionally, until the fat has seeped into the pan and is sizzling gently, and the bacon is crisp. Take off the heat and leave to cool slightly. Scrape the bacon and the fat into a food processor with the butter and maple syrup. Blitz to combine, scraping down the sides of the processor from time to time. Roll up the butter in cling film to form a log and place in the fridge. Can be made a few days ahead or frozen for 1 month.", "Remove the turkey from the fridge an hour or so before you want to cook it. Remove the bacon butter from the fridge to soften up. Heat oven to 180C/160C fan/gas 4. Calculate your cooking time based on 40 mins per kg for the first 4kg of the turkey, plus 45 mins for every kg after that.", "Gently push your fingers under the skin of the turkey, starting from the neck, until you can push your whole hand in down the length of the breast. Take care not to tear the skin. Use your hands to spread the bacon butter under the skin so that it covers the entire breast area, and there is butter in the crevice between the thigh and the main body. Pop a sprig of thyme under the skin of each breast, then smooth the skin over with your buttery hands. Place the onion, lemon, bay leaves and garlic in the cavity.", "Cover the tin loosely with foil and roast for the calculated cooking time – 30 mins before the end of cooking, increase the oven temperature to 200C/180C fan/gas 6, remove the foil, baste the turkey and return to the oven. When the turkey is beautifully brown and cooked through, remove from the oven and leave to rest on a warm platter covered in foil for up to 1 hr.", "Pour the fat away from the roasting tin, leaving just the juices. If your tin is flameproof, pour in the Sticky Port gravy (see 'Goes well with', right) to reheat with the juices; if not, tip them both into a saucepan and reheat. Serve the remaining salt mix as a seasoning alongside the rest of the meal."]},
{"Name": "Mulled wine cocktail", "url": "https://www.bbcgoodfood.com/recipes/8143/mulled-wine-cocktail", "Description": "Beautiful flavours, I tried this room temperature, warm and cold. My preference was the room temperature. As we left it for a few days in the fridge the flavours really developed to a spicy taste.", "Author": "Mary Cadogan", "Ingredients": ["100g/4oz light muscovado sugar", "1 star anise", "1 cinnamon stick", "4 cloves", "150ml water", "1 lemon", "2 clementines", "150ml Cointreau", "750ml/ 1¼pint bottle light red wine, such as Beaujolais", "Twist of orange zestand a star anise, to serve"], "Method": ["Put 100g light muscovado sugar in a pan with 1 star anise, 1 cinnamon stick, 4 cloves and 150ml water. Bring slowly to the boil, stirring to dissolve the sugar.", "Simmer for 2 mins, then pour into a large jug and leave to cool. Add 1 lemon and 2 clementines, both thinly sliced, to the jug along with 150ml Cointreau and a 750ml bottle light red wine, such as a Beaujolais. Stir well, then cover and chill for at least 2 hrs or overnight if you can.", "Serve chilled or over ice, with a twist of orange zest and a star anise. If you’d like to serve a traditional warm mulled wine, there’s no need to chill – simply warm through without boiling and serve in heatproof glasses."]},
{"Name": "Butternut Dauphinoise", "url": "https://www.bbcgoodfood.com/recipes/butternut-dauphinoise", "Description": "This indulgent gratin of squash with bay, thyme and nutmeg, plus a robust cheese sauce makes a great main or side dish", "Author": "Jane Hornby", "Ingredients": ["300ml pot double cream", "100ml whole milk", "2 bay leaves", "a few thyme sprigs", "1 garlic clove, crushed", "whole nutmeg, for grating", "1 tbsp salted butter, for greasing", "1 large butternut squash, peeled and thinly sliced (about 1.4kg unpeeled to give about 1.1kg prepared flesh)", "50g mature Double Gloucesteror other hard cheese"], "Method": ["Put the cream, milk, bay, a sprig of thyme, the garlic and ¼ tsp freshly grated nutmeg in a saucepan, and bring to the boil. Take the pan off the heat and leave to infuse for 10 mins. Heat oven to 180C/160C fan/gas 4.", "Grease a large baking dish with the butter, then layer up the butternut squash, adding seasoning and a few thyme leaves as you go. Pour over the infused cream, leaving the bay and thyme on the top.", "Cover the dish with foil and bake for 30 mins. Uncover, press the squash as far under the level of the liquid as you can, then scatter with the cheese. Bake, uncovered, for 30 mins more until the butternut is tender and the whole dish is bubbling and golden. Let stand for 10 mins or so before serving."]},
{"Name": "Root vegetable tatin with candied nuts & blue cheese", "url": "https://www.bbcgoodfood.com/recipes/root-vegetable-tatin-candied-nuts-blue-cheese", "Description": null, "Author": "Katy Greenwood", "Ingredients": ["500g block puff pastry", "3 slim carrots, about 12-13 cm long, halved lengthways", "3 slim parsnips about 12-13 cm long, halved lengthways plus 1 large parsnip, peeled and grated", "2 tbsp olive oil", "2 heaped tbsp slightly salted butter", "5 banana shallots, 3 halved lengthways, 2 thinly sliced", "small bunch sage, leaves picked and finely chopped", "4 rosemary sprigs, leaves picked and finely chopped", "2 garlic cloves, finely grated or crushed", "100g caster sugar", "125ml red wine vinegar", "100g blue cheese, crumbled (we used Cropwell Bishop)", "50g walnuts, roughly chopped", "25g caster sugar", "2 tsp butter", "3 rosemary sprigs"], "Method": ["Heat oven to 200C/180C fan/gas 6. ", " the pastry to just larger than a 30cm diameter ovenproof frying pan and use the pan as a template to cut out a round of pastry. Leave in the fridge, or a cool place while you prepare everything else.", "Bring a ", " of water to the boil, add the carrots and parsnips and cook for 5 mins. Drain and set aside to dry off slightly. Heat the oil and 1 tbsp of the butter in your pan and cook the sliced shallots and grated parsnips for 1-2 mins over a medium-high heat until just starting to brown, then add a good splash of water to the pan, stir to scrape up any brown bits, turn the heat down slightly, cover and cook for 4-5 mins, stirring every so often. The parsnips should be tender. Add the herbs and garlic and cook for another minute, then tip into a bowl, scraping out as well as you can. Season a little and set aside.", "Add the sugar and vinegar to the pan and bring to the boil. Cook for a few minutes until syrupy, then stir in the remaining butter. Set aside to cool slightly, then arrange the vegetables in the pan, fanning them out. Top with the herby shallot and parsnip mixture, pushing it into any spaces there may be. Lay the pastry over the top of the vegetables and push in the edges a little. Place in the oven and bake for 30-35 mins until puffed and deep golden brown. ", "While the tart bakes, put the nuts, sugar and butter in a small frying pan with a pinch of salt. Cook over a medium-high heat for about 5 mins, stirring, until the sugar has dissolved and coated the nuts. Add the rosemary for the last minute. Tip out onto a piece of baking parchment and leave to cool for a few minutes.", "Once the tart is baked, remove from the oven and carefully turn out onto a serving board. Scrape out any bits that are left in the tin and add back to the tart. Bash the nuts to break them up and scatter over, along with the crumbled cheese."]},
{"Name": "Sweet potato parcel", "url": "https://www.bbcgoodfood.com/recipes/sweet-potato-parcel", "Description": "We really enjoyed this pie. The only thing I would say is that the sweet potato could spend less time in the oven before going in the pie as it will finish cooking in it. You just save some power from not having the oven on so long. I might make it as individual pies next time.", "Author": "Katy Greenwood", "Ingredients": ["4 sweet potatoes(about 750g), peeled and cut into 2-3cm chunks", "5 tbsp cold pressed rapeseed oil", "1 onion, thinly sliced", "2 large garlic cloves, crushed", "½ tsp chilli flakes", "1 small bunch sage, leaves sliced", "180g pack chestnuts, roughly chopped", "3 tbsp cranberry sauce", "5 sheets filo pastry(we used Jus-Rol)"], "Method": ["Heat oven to 200C/180C fan/gas 6. Put the potatoes on a ", ", toss with 1 tbsp of the oil, season and roast for 25 mins.", "While the potatoes roast, heat another 1 tbsp oil in a frying pan and cook the onion over a medium heat for about 7-10 mins to soften. Stir in the garlic, chilli flakes and sage and cook for another minute or 2. Remove from the heat and add the chestnuts, cranberry sauce and the sweet potato cubes. Season a little. ", "Line a 20cm square tin with a rectangle of baking parchment that comes up two sides of the tin (this is to help you remove it later). Put 1 sheet of filo in the tin, brushing the bottom and sides with a little of the remaining oil, then add another piece of filo going in the other direction (like a cross). Brush with more oil on the bottom and sides, and repeat with another 2 sheets of filo.", "Spoon the sweet potato mixture into the tin and fold over the filo to cover, brushing with a little more of the oil. Brush the last piece of filo with the remaining oil, then scrunch on top of the parcel. Put in the oven and bake for 30 mins. 5 To serve, use the baking parchment to lift the parcel out", "of the tin and cut into four."]},
{"Name": "Tilly's trifle", "url": "https://www.bbcgoodfood.com/recipes/3037/tillys-trifle", "Description": "Gordon Ramsay's traditional trifle is the perfect treat to satisfy the whole family.", "Author": "Gordon Ramsay", "Ingredients": ["4 sheets leaf gelatine", "650g jar Morello cherries", "2 tbsp redcurrant jelly", "1 Swiss roll", "3-4 tbsp medium dry sherry, optional", "70g amaretti biscuits, crushed", "1 vanilla pod, split in half", "8 egg yolks", "50g golden caster sugar plus 1 tbsp", "4 tsp plain flour", "568ml pot double cream", "284ml pot double cream", "50g chopped unsalted pistachios", "30g amaretti biscuits, crushed", "handful physalis(Cape gooseberries)"], "Method": ["First, make the jelly. Soak the gelatine leaves in cold water until floppy, then drain. Strain off the juice from the cherries into a jug – you should have around 350-400ml. Put the juice and the redcurrant jelly in a pan, stirring until it boils and the redcurrant jelly has melted. Take off the heat, cool for a few mins, then stir in the gelatine until it dissolves. Pour into a shallow pan or dish to cool, then chill until set.", "For the custard, scrape the vanilla seeds from the pod into a large bowl. Add the egg yolks, 40g sugar and the flour, then whisk until pale and creamy. Pour the cream into a medium-size pan and bring just to the boil. Gradually whisk the cream into the yolk mix. Wipe out the pan, then return the mixture to it. Cook slowly over a low heat, stirring with a wooden spoon until thickened – take extra care to stir well at the edges of the pan. Cool, stirring every so often.", "To assemble the trifle, slice the Swiss roll into 8 pieces and arrange on the base and around the inside of a large glass serving bowl. Sprinkle with the sherry, if using.", "Turn the jelly out onto a board and chop with a sharp knife. Scatter the drained cherries and chopped jelly on top of the Swiss roll, then sprinkle over the crushed amaretti.", "Pour the cooled custard over the biscuits, then return to the fridge until cold (about 2 hrs). For the topping, whip the cream to soft peaks with 1 tbsp sugar, then spoon or pipe it over the custard. The trifle can be covered and chilled for up to 2 days at this point.", "To serve, sprinkle over the pistachios and remaining amaretti. Push back the leaves of the physalis and poke the fruit into the cream."]},
{"Name": "Sausage & fennel seed slices", "url": "https://www.bbcgoodfood.com/recipes/sausage-fennel-seed-slices", "Description": "I guess you could do it this way with any sausage roll recipe but this was really convenient for freezing and having it on stand-by. They were also really delicious! I had a couple of \"rolls\" in the freezer over Xmas and NY and I plan to do several more for the summer - I get houseful so of teenager and this is so handy to have around.\nThe instructions do look a bit daunting but actually it's very easy. It's worth doing because it's much easier to cut the pastry tidily before it's cooked than after!", "Author": "Miriam Nice", "Ingredients": ["400g pack pork sausage, skin removed", "375g ready-rolled puff pastrysheet", "1 tbsp fennel seeds", "1 egg, beaten"], "Method": ["Put the skinned sausages in a bowl and squish together with your hands, then divide into two balls. Place one ball of sausagemeat onto a long piece of cling film. Roll into a cylinder approx 30cm long. Wrap tightly in the cling film and place on a plate or tray in the fridge. Repeat with the other ball of sausagemeat.", "Heat oven to 200C/180C fan/gas 6. Lay the pastry out on your work surface and cut it into four equal strips lengthways. Roll two of the strips out a little more with a rolling pin so that they are 40cm long and 10cm wide. Unwrap the sausagemeat, place each one in the middle of a rolled-out pastry length and sprinkle each with half the fennel seeds. On either side of the meat, cut regular slits from the edge up to the meat – do this all the way round to create 2cm tabs. Fold over the ends. Starting at one end, bring up one tab from one side and drape it over the meat, then do the same with one from the opposite side. Repeat with the other strip of sausagemeat. Brush both with egg, then lift onto baking trays.", "Cut each of the remaining strips of pastry into three strips lengthways and plait together. Lay the plait on top of the sausage pastries and brush with more egg.", "Bake in the oven for 40 mins or until risen and golden brown. Remove from the oven, transfer to a large board and slice – or allow your guests to serve themselves. Can be served hot or cold."]},
{"Name": "Smoky sweet root vegetables", "url": "https://www.bbcgoodfood.com/recipes/smoky-sweet-root-vegetables", "Description": null, "Author": "Sophie Godwin", "Ingredients": ["75g butter", "75g caster sugar", "600g baby carrots, scrubbed (about 2cm of the tops left on), any larger ones cut in half lengthways", "600g baby parsnips, scrubbed, any larger ones cut in half lengthways", "smoked salt", "1 lemon, juiced", "parsley, roughly chopped"], "Method": ["The day before, put the butter, sugar and 500ml water in a deep frying pan. Heat until the butter is melted, then bring the liquid to the boil and simmer until lightly syrupy. Drop in the parsnips and cook, covered, for 6-8 mins until just tender then, using tongs, transfer to a roasting tin. Repeat with the carrots then tip them, with the liquid, into the roasting tin with the parsnips. Leave to cool, then put in the fridge overnight.", "When you are ready to eat, take the roots out the fridge, and lift out of the syrup. Discard the syrup. Heat a ", " or frying pan until searing hot then, in batches, put the roots cut-side down in the pan and cook for a min on each side until visibly charred. Sprinkle over the smoked salt, lemon juice and some parsley to serve."]},
{"Name": "Brown rice canapé bowl", "url": "https://www.bbcgoodfood.com/recipes/brown-rice-canape-bowl", "Description": null, "Author": "Elena Silcock", "Ingredients": ["1 x 200g pouch microwavable brown rice", "selection of leftover Asian-style canapés(we used 6 gyoza and 120g tempura prawns)", "1 carrot, peeled into ribbons with a vegetable peeler", "½ cucumber, cut into sticks", "100g frozen edamameor peas, cooked and cooled", "½ small pack coriander", "sesame seeds (optional) and pickled ginger or fresh ginger, cut into matchsticks, to serve", "1 tbsp sweet chilli sauce", "2 tbsp soy sauce", "1 tsp sesame oil"], "Method": ["Whisk the dressing ingredients together and set aside. Cook the rice following pack instructions, divide between two bowls and drizzle over half the dressing. Reheat the canapés.", "Arrange all the remaining ingredients on top of the rice, making sections of carrot, cucumber, edamame, and canapés. Top with the coriander, sesame seeds and pickled ginger. Drizzle over the remaining dressing and serve."]},
{"Name": "Chocolate Jaffa pots", "url": "https://www.bbcgoodfood.com/recipes/2766669/chocolate-jaffa-pots", "Description": "I made this and i too found i needed double the jelly mixture, i didn't have enough so i had to use normal orange jelly but it was fine, would have preferred the original jelly, it had such lovely flavour. Would used tinned mandarins next time, far too much hassle peeling your own. Very popular though.", "Author": "John Torode", "Ingredients": ["300g madeira cake", "300g sugar", "1 vanilla pod, split lengthways", "1 cinnamon stick", "200ml clementinejuice (from about 4 clemetines), plus 4 clementines", "3 sheets leaf gelatine", "400ml double cream", "225g dark chocolate, roughly chopped", "3 tbsp orange liqueur", "25g butter, softened"], "Method": ["To make the clementine jelly, put the sugar, vanilla pod, cinnamon stick, clementine juice and 100ml water in a large pan and bring to a gentle simmer. Meanwhile, peel the clementines and remove all the pith and outside membranes. Put the broken-up segments into a bowl and pour over the spiced sugar syrup. Cover with cling film and allow to macerate for at least 30 mins.", "Meanwhile, cut the madeira cake into 2cm-thick slices, trimming off and discarding the dark edges. Divide the slices between 12 glasses and push down in an even layer. Soak the gelatine leaves in cold water.", "Drain the clementines, pouring the liquid into a small saucepan. Discard the vanilla and cinnamon stick. Divide the clementines between the glasses in an even layer. Gently warm the liquid. Once it is warm, squeeze the gelatine to remove the excess water and stir into the warm liquid until completely melted.", "Pour a layer of the jelly over the clementines. Transfer the pots to the fridge and allow to set for at least 3 hrs.", "To make the chocolate layer, heat the cream to just below boiling. Remove from the heat, add the chocolate and stir until melted and smooth. Add the liqueur and butter and mix until fully combined. Pour into a jug and allow to cool for 15-20 mins. Pour on top of the jelly and put back in the fridge for a few hours to set."]},
{"Name": "Pecan mince pie", "url": "https://www.bbcgoodfood.com/recipes/pecan-mince-pie", "Description": "Take this beautiful mincemeat, nut-topped tart along to a festive buffet or serve with an indulgent brandy cream as an alternative to the traditional Christmas pud", "Author": "Barney Desmazery", "Ingredients": ["250g plain flour, plus extra for dusting", "140g cold butter, diced", "2 tbsp golden caster sugar", "1 tbsp milk", "zest 1 orange, finely grated", "300g pecans", "2 eggs", "100g golden syrup", "50g butter, melted", "400g homemade mincemeat(see goes well with for recipe), or a 411g shop-bought jar", "300ml double cream", "2 tbsp icing sugar", "4 tbsp brandy", "splash of vanilla extract", "large pinch of cinnamon"], "Method": ["To make the pastry, put all the ingredients in a food processor and pulse until it comes together, then tip onto a surface and knead into a ball. Wrap in cling film and chill in the fridge for 30 mins.", "Roll out the pastry on a lightly floured surface and use to line a 23cm tart tin, leaving any excess pastry overhanging. Chill for a further 30 mins.", "Heat oven to 190C/170C fan/gas 5 with a baking sheet on the middle shelf. Prick the pastry base with a fork and line the tin with baking parchment and baking beans or some dry rice. Place on the baking sheet and bake for 20 mins until golden around the edges. Remove the parchment and beans, and return to the oven for 10 mins more until the base is biscuit-brown.", "While the pie case is baking, make the filling. Finely chop half the pecans by hand or by pulsing in a food processor, then tip into a bowl. Mix in the eggs, golden syrup and melted butter until completely combined, then stir in the mincemeat.", "When the pie case is cooked, spoon over the mincemeat pecan filling and top with the reserved whole pecans. Bake for 20-25 mins until the top is just set, then remove from the oven to cool slightly.", "To make the brandy cream, whisk together the cream and the icing sugar until holding soft peaks, then gently whisk in the brandy, vanilla and cinnamon. Serve the pie warm in slices with a dollop of the cream."]},
{"Name": "Choc hazelnut truffles", "url": "https://www.bbcgoodfood.com/recipes/2768693/choc-hazelnut-truffles", "Description": "Wrap these decorative chocolates in cellophane and pack in boxes to give as gifts or simply bring out after dinner to wow your guests", "Author": "Good Food", "Ingredients": ["175ml double cream", "200g bar dark chocolate, finely chopped", "1 tbsp Frangelicoor 1 tsp vanilla extract", "50g hazelnut, roughly chopped", "different coloured sprinklesand edible glitters"], "Method": ["In a small saucepan, bring the cream to the boil. Remove from the heat and pour over the chopped chocolate. Gently stir the mixture until smooth, then add the alcohol or vanilla extract and hazelnuts. Cover and put in the fridge for 30 mins or until the mixture is thick but not solid.", "Scoop out teaspoons of the mixture and roll into small balls with your hands. Put each of your sprinkles or glitters onto separate small plates or bowls. Roll each truffle into the sprinkles or glitter to coat, then chill again to firm up. Will keep chilled for 1 week, or freeze for up to 1 month without the decoration."]},
{"Name": "Piña colada", "url": "https://www.bbcgoodfood.com/recipes/pina-colada", "Description": "Nice and strong! I used Coco Lopez as the coconut element (bought off Amazon).", "Author": "Good Food", "Ingredients": ["120ml pineapplejuice", "60ml white rum", "60ml coconut cream", "wedge of pineapple, to garnish (optional)"], "Method": ["Pulse all the ingredients along with a handful of ice in a blender until smooth. Pour into a tall glass and garnish as you like."]},
{"Name": "Thai turkey filo dippers", "url": "https://www.bbcgoodfood.com/recipes/thai-turkey-filo-dippers", "Description": "Fill filo pastry parcels with turkey or chicken mince, spring onions and ginger for a buffet nibble or party canapé similar to a spring roll", "Author": "Justine Pattison", "Ingredients": ["3 sheets filo pastry, each about 24 x 48cm", "4 tbsp sunflower oil", "1½ tsp sesame seeds(optional)", "Thai sweet chilli dipping sauce, to serve", "250g turkeyor chicken mince", "6 spring onions, trimmed and finely sliced", "25g piece fresh ginger, peeled and finely grated", "2 garlic cloves, crushed", "1 tbsp Thai red curry paste", "1 tbsp Thai fish sauce(Nam pla)", "2 lime leaves, very finely sliced"], "Method": ["To make the filling, mix all the ingredients in a small bowl until thoroughly combined. Cut each sheet of filo pastry into 4 evenly sized rectangles. Make a pile of 12 rectangles and cover with a damp tea towel to stop them drying out.", "Brush 1 of the rectangles lightly with oil. With one of the shortest sides facing you, spoon 1 level tbsp of the filling across the pastry 2cm up from the bottom of the rectangle and around 1cm in from both sides. Form into a sausage shape. Fold in the bottom over the filling, then fold in the 2 long sides all the way up the rectangle. Roll up from the short side close to you, fully enclosing the filling.", "Place on a baking tray lined with baking parchment. Repeat as above to make a further 11 filo rolls. Brush with more oil and sprinkle with sesame seeds, if using. Can be covered with cling film at this stage and kept in the fridge for up to 8 hrs before baking.", "Heat oven to 200C/180C fan/gas 6. Bake the dippers for 10-15 mins or until the pastry is light golden brown and the filling is cooked thoroughly. Serve with Thai sweet chilli dipping sauce."]},
{"Name": "Yule slice", "url": "https://www.bbcgoodfood.com/recipes/4930/yule-slice", "Description": "Perfect for health-conscious people who still like a Christmas treat, this is dairy-free and full of fruit and nuts", "Author": "Mary Cadogan", "Ingredients": ["200g walnut halves", "100g hazelnut", "50g blanched almond", "200g raisin", "100g pitted date, chopped", "200g dried apricot, chopped", "140g glacé cherry or pineapple", "100g plain flour", "2 tsp mixed spice", "½ tsp baking powder", "175g dark muscovado sugar", "3 eggs", "1 tsp vanilla extract", "icing sugar, for dusting"], "Method": ["Heat oven to 150C/fan 130C/gas 2. Line the base and sides of a 1.5-litre loaf tin (a long thin one is best) with baking parchment. Mix the nuts and dried fruit thoroughly in a large bowl using your hands. Sift in the flour, spice and baking powder, then add the sugar and mix everything well. Beat the eggs with the vanilla, then add to the dry mix, turning everything together well until there is no dry mix visible.", "Turn into the prepared tin and smooth the top. Bake for 1½-1¾ hrs, then cool in the tin for 15 mins. Turn out, peel off the paper and cool on a wire rack. Dust the top thickly with icing sugar, to serve."]},
{"Name": "All-the-trimmings roast potatoes", "url": "https://www.bbcgoodfood.com/recipes/5029/allthetrimmings-roast-potatoes", "Description": "Save space and time by throwing everything together in the same bowl. Perfect for people without a four-doored oven", "Author": "Barney Desmazery", "Ingredients": ["4 large potatoes, cut into chunks", "2 tbsp vegetable oil", "12 cocktail sausages", "200g chestnut", "handful parsley leaves, roughly chopped"], "Method": ["Heat oven to 230C/fan 210C/gas 8. Tip the potatoes into a roasting tin and toss in oil. Place in the oven on the shelf below thepoussin and roast undisturbed for 30 mins.", "Toss through the sausages and chestnuts, then cook 15 mins more until the sausages are brown. Scatter over the parsley to serve."]},
{"Name": "Mustard-glazed roast chicken with Waldorf stuffing", "url": "https://www.bbcgoodfood.com/recipes/2530636/mustardglazed-roast-chicken-with-waldorf-stuffing", "Description": "A few extra vegetables will turn this recipe into a Sunday lunch spread - get ahead by making the stuffing in advance", "Author": "Good Food", "Ingredients": ["1 large chicken(about 2kg/4lb 8oz)", "25g butter", "1 tbsp wholegrain mustard", "roast potatoes and vegetables, to serve (optional)", "3 celerysticks, finely chopped", "2 red apples, cored and finely chopped", "100g walnut, chopped", "100g fresh breadcrumb, handful reserved for the topping", "400g sausagemeat(6 sausages)", "1 medium egg", "handful parsley, chopped", "2 tbsp wholegrain mustard", "25g butter, plus extra for greasing"], "Method": ["Heat oven to 190C/170C fan/gas 5. To make the stuffing, mix together all the ingredients, except the butter, in a large bowl with some seasoning. Scrunch with your hands until well combined.", "Season the chicken all over and put in a roasting tin. Smear with the butter and put on the middle shelf of the oven for 50 mins.", "Meanwhile, grease a 20 x 30cm roasting tin. Press in the stuffing, then sprinkle with the reserved breadcrumbs and dot with the butter.", "Brush the chicken with the mustard, transfer it to a lower shelf and roast for 40 mins more until cooked through and the juices run clear. Put the stuffing on the top shelf at the same time and cook for 40-50 mins until golden and crisp.", "Leave the chicken to rest for 10 mins, then serve with the stuffing, along with roast potatoes and veg, if you like."]},
{"Name": "Cheeseboard soufflé & seasonal salad", "url": "https://www.bbcgoodfood.com/recipes/1841667/cheeseboard-souffl-and-seasonal-salad", "Description": "This luxuriously light soufflé is a good way to use up a selection of leftover cheeses", "Author": "Barney Desmazery", "Ingredients": ["50g butter, plus extra for greasing", "25g plain flour, plus extra for dusting", "200ml milk", "300g leftover hard cheese, cut into chunks", "100ml double cream or crème fraîche", "4 eggs, separated", "grating of nutmeg", "pinch cayenne pepper", "110g bag salad leaf", "100g leftover blue or goat's cheese, crumbled", "50g leftover shelled nut", "1 pear, sliced", "3 tbsp salad dressing(use your favourite), to serve"], "Method": ["Heat oven to 200C/180C fan/gas 6. Melt all the butter in a saucepan. Brush a 20cm soufflé dish with a little of it, then dust with flour. In the saucepan, stir the flour into the rest of the melted butter, then sizzle everything for 1 min. Gradually pour in the milk to make a white sauce, then add two-thirds of the cheese and carry on cooking to melt. Leave to cool slightly, then mix in the remaining cheese, the cream or crème fraîche and the egg yolks. Season, then add the nutmeg and cayenne pepper.", "In a clean bowl, whisk the egg whites until stiff. Fold into the cheese sauce, then carefully tip into the soufflé dish. Bake the soufflé for 25 mins until puffed up and golden.", "While the soufflé is cooking, toss the salad ingredients together. Once the soufflé is cooked, dress the salad and serve alongside."]},
{"Name": "Crispy squashed baby roasties", "url": "https://www.bbcgoodfood.com/recipes/3087686/crispy-squashed-baby-roasties", "Description": "Fennel seeds and flaky sea salt give these roasted new potatoes a crispy, flavoursome finish", "Author": "Cassie Best", "Ingredients": ["1kg small salad or new potato", "4 tbsp olive oil", "2 tsp fennel seed", "1 tbsp flaky sea salt"], "Method": ["Boil the potatoes for 10 mins until tender, then drain and leave to steamdry. While the pork is resting (see left), lower the oven to 200C/180C fan/gas 6.", "Drizzle half the oil over a flat, sturdy baking tray and tip in the potatoes. Add the fennel seeds, and season with the flaky sea salt and some black pepper, tossing everything to coat. Gently squash the potatoes with a potato masher to just break the skins. Drizzle with the extra oil and bake for 45 mins until crispy and golden."]},
{"Name": "Rudolph’s carrot flapjacks", "url": "https://www.bbcgoodfood.com/recipes/1840648/rudolphs-carrot-flapjacks", "Description": "These moist oaty slices are packed full of fruits, seeds and spices - a great bake to make with the kids", "Author": "Good Food", "Ingredients": ["200g butter", "100g golden syrup", "50g soft light brown sugar", "300g rolled oats", "2 grated carrots", "zest 1 orange", "100g chopped apricot", "1 tsp cinnamon", "50g pumpkin seed"], "Method": ["Heat oven to 160C/140C fan/gas 3. Line an 18cm square baking tin with greaseproof paper. Melt butter, golden syrup and sugar in a large pan. Mix in rolled oats, carrots, orange zest, apricots, cinnamon and pumpkin seeds. Stir everything well, then pack into the prepared tin, pushing down firmly. Bake for 40-45 mins, then cool in the tin before slicing into 16 squares."]},
{"Name": "Simple seafood platter", "url": "https://www.bbcgoodfood.com/recipes/5027/simple-seafood-platter", "Description": "Raid your local fishmongers for a selection to suit your budget and you have an instant impressive starter", "Author": "Barney Desmazery", "Ingredients": ["about 800g mixed seafood prawns, smoked salmon and gravadlax", "lemon wedges, to serve", "brown bread, to serve", "juice 1 lemon", "1 tbsp Dijon mustard", "150ml good-quality mayonnaise", "small bunch dill, finely chopped"], "Method": ["Whisk the lemon juice with the mustard, then mix into the mayonnaise with the dill. Prepare up to a day ahead and chill.", "Lay out the seafood on a platter with lemon wedges and a bowl of the mayonnaise in the middle so everyone can help themselves. Serve with plenty of fresh brown bread."]},
{"Name": "Stilton & chutney rarebit bites", "url": "https://www.bbcgoodfood.com/recipes/8861/stilton-and-chutney-rarebit-bites", "Description": "The chutney for this moreish canape can be\nmade in bigger quantities and stored in jars for a couple of\nmonths – delicious with cheese and crackers", "Author": "Laura and Jess Tilli", "Ingredients": ["2 red onions, thinly sliced", "4 tbsp muscovado sugar", "100ml balsamic vinegar", "300g stilton, crumbled", "200g parmesan(or vegetarian alternative), grated", "2 tbsp crème fraîche", "2 eggs, beaten", "2 tsp wholegrain mustard", "6 slices sourdough breador German rye bread"], "Method": ["Put the onions, sugar and vinegar into a large pan on a low heat. Cook for about 25 mins, stirring now and again, until gloopy and sticky. Cool. Mix together the cheeses, crème fraîche, eggs and mustard with some seasoning, then chill.", "To serve, heat the grill, lightly toast the bread and cut each slice into chunks. Put onto a baking sheet, spread a tsp of chutney on each chunk, then pile on the rarebit mixture – as much as the little squares can hold. Grill for 3-5 mins until golden brown and bubbling."]},
{"Name": "Jumbo turkey samosas", "url": "https://www.bbcgoodfood.com/recipes/jumbo-turkey-samosas", "Description": "Use up leftover cooked potatoes and turkey in these spiced filo pastry parcels, then serve with tangy mango chutney", "Author": "Cassie Best", "Ingredients": ["3 tbsp curry paste(we used korma)", "2 tbsp mango chutney, plus extra to serve", "2 tbsp natural yogurtfrom a 150g pot (serve the remainder)", "200g leftover cooked potatoes(roasted or boiled are fine), chopped into small chunks", "250g cooked turkeyor chicken, chopped into small pieces", "250g frozen peas", "bunch coriander, chopped, plus a few leaves picked to serve", "270g pack filo pastry(6 sheets)", "4 tbsp vegetable oil", "1 egg, beaten", "1 tbsp sesame seeds"], "Method": ["In a large bowl, combine the curry paste, mango chutney and 2 tbsp yogurt, and mix well. Fold in the potatoes, turkey, peas and coriander, then season well.", "Heat oven to 200C/180C fan/gas 6. Cut the sheets of filo in half lengthways so you have 12 strips – keep the pastry covered with a tea towel while you work so it doesn’t dry out. Layer up 3 sheets of filo, brushing a little oil between each sheet. Pile a quarter of the filling in the top corner of the pastry in a triangle shape. Fold the pastry over to encase the filling, then keep folding until the parcel is sealed and the filo is used up. Brush the final edge with a little beaten egg to help stick the pastry together. Repeat to make all 4 jumbo samosas.", "Lay your samosas on a baking sheet and brush each one with more beaten egg, then sprinkle with sesame seeds. Bake for 35 mins or until the samosas are golden brown and the filling is piping hot. Serve with the remaining yogurt, some mango chutney and coriander leaves."]},
{"Name": "Ham & veg crumble", "url": "https://www.bbcgoodfood.com/recipes/ham-veg-crumble", "Description": "Ham and root vegetables are coated in a creamy mustard and crème fraîche sauce, then topped with savoury crumble in this winter bake", "Author": "Cassie Best", "Ingredients": ["100g butter", "2 leeks, chopped", "3 carrots, chopped", "3 parsnips, chopped", "½ celeriac, chopped", "200g plain flour", "500ml hot chicken or vegetable stock", "400g cooked ham, cut into chunky slices from a joint, then shredded", "200g tub low-fat crème fraîche", "2 tbsp wholegrain mustard"], "Method": ["Melt 2 tbsp butter in a large frying pan, chop the remaining butter into small chunks and put in the fridge. Add the leeks, carrots, parsnips and celeriac to the pan with a splash of water, season, cover with a lid and cook for 10-15 mins, stirring now and then, until the veg is beginning to soften.", "Stir in 2 tbsp plain flour, then add the stock bit by bit, stirring as you go, until all incorporated and smooth. Cover with a lid and simmer for 20 mins until the vegetables are tender.", "Heat oven to 220C/200C fan/gas 6. Add the ham, all but 2 tbsp of the crème fraîche, and the mustard, season with plenty of black pepper and transfer to an ovenproof baking dish. Put the remaining butter and flour in a bowl and season. Rub together with your fingers to a fine crumbly texture. Add the remaining crème fraîche and mix with a cutlery knife until the crumble clumps together in places. Sprinkle the crumble mixture over the filling, then bake for 35-40 mins until crispy and golden on top."]},
{"Name": "Warm greens & shallots with allspice dressing", "url": "https://www.bbcgoodfood.com/recipes/warm-greens-shallots-allspice-dressing", "Description": "Add some sweetness and spice to your Sunday lunch with this easy veggie side dish - perfect with roast lamb or chicken", "Author": "Cassie Best", "Ingredients": ["400g shallots", "1 tbsp olive or rapeseed oil", "3 tbsp white wine vinegar", "3 tbsp clear honey", "½ tsp ground allspice", "400g mixed green vegetables(we used green beans, broccoli and peas)"], "Method": ["Cover the shallots with boiling water and set aside until cool enough to handle, then peel and discard the skins.", "Heat the oil in a large pan, and add the shallots. Cover with a lid and cook over a low heat for 8-10 mins until starting to caramelise. Add the vinegar, honey and allspice to the pan along with some seasoning. Give everything a good shake in the pan, then bubble for 10 mins until the shallots are tender and sticky, adding a splash of water if the honey looks like it might burn.", "Meanwhile, bring a large pan of water to the boil, add the greens and cook for 2 mins until they are just tender but still have a nice bite. Add to the shallots and toss through the sticky dressing."]},
{"Name": "Buckwheat & spelt chrain blinis", "url": "https://www.bbcgoodfood.com/recipes/buckwheat-spelt-chrain-blinis", "Description": null, "Author": "Rosie Birkett", "Ingredients": ["50g buckwheat flour", "120g light spelt flour", "7g fast action dried yeast", "125ml milk", "200g natural yogurt", "2 medium eggs, separated", "1 ready-to-eat beetrootblended with 30g horseradish, or 2 tbsp chrain (beetroot and horseradish purée)", "20g clarified butter", "soured cream, smoked trout, dill and salmon roe (optional), to serve"], "Method": ["Sift the buckwheat and spelt flours into a bowl with 1 tsp salt and scatter over the yeast. Heat the milk and yogurt very gently until tepid, then ", " in the egg yolks. Whisk this mixture into the flour mix and leave for 1 hr to ferment.", "Whisk the egg whites to stiff peaks. Stir the beetroot and horseradish purée through the batter, then lightly fold in the egg whites. Leave for a further hour.", "Heat the clarified butter in a non-stick frying pan, then add in dessertspoonfuls of blini mix. Fry for about 40 secs, or until they naturally come away from the pan when you shake it. They should puff up, and you’ll need to be careful when turning over as the middle might try and escape a bit – use a palette knife for this. Turn over and fry for another 20-30 secs, then transfer to kitchen paper. Continue with the rest of the mix. Leave to cool, then freeze the blinis for up to one month.", "When your blinis are done, top with the soured cream, smoked trout, dill and salmon roe, if using, then serve."]},
{"Name": "Orange & spice wings", "url": "https://www.bbcgoodfood.com/recipes/orange-spice-wings", "Description": null, "Author": "Miriam Nice", "Ingredients": ["1kg chicken wings", "2 tbsp plain flour", "2 tbsp oil", "50g festive spice mix, see <a href='https://www.bbcgoodfood.com/recipes/festive-spice'>our recipe</a>", "1 orange, juiced", "1 tbsp honey", "pinch of salt, to serve"], "Method": ["Heat oven to 200C/180C/gas 6. Put the chicken wings in a large bowl with plain flour and season well. Toss together to coat, then spread out over a large baking tray, drizzle with oil and cook for 40-45 mins, turning halfway through.", "When the chicken wings are nearly done, put the ", " in a saucepan with the orange juice and honey. Warm gently, then pour over the chicken wings, toss together, and return to the oven for a further 10 mins or until sticky. Sprinkle with salt to serve. "]},
{"Name": "Non-alcoholic mulled wine", "url": "https://www.bbcgoodfood.com/recipes/mock-mulled-wine", "Description": null, "Author": "Miriam Nice", "Ingredients": ["500ml pomegranate juice", "25g golden caster sugar", "handful of frozen blackberries", "250ml apple juice", "1 cinnamon stick", "1 star anise", "4 cloves", "3 black peppercorns", "1 orange, quartered"], "Method": ["Put the pomegranate juice, sugar, blackberries and apple juice in a saucepan. Add the cinnamon, star anise, cloves, peppercorns and orange. Heat gently until simmering. Taste for sweetness, then strain into heatproof glasses."]},
{"Name": "Spiced piña colada mocktail", "url": "https://www.bbcgoodfood.com/recipes/spiced-pina-colada-mocktail", "Description": null, "Author": "Miriam Nice", "Ingredients": ["150ml pineapple juice", "50ml coconut milk", "25ml lime juice", "ice", "cherry, to garnish", "100g dark brown muscovado sugar", "1 pineapple, a few strips of skin, plus leaves to garnish", "5 black peppercorns", "5 cloves", "1 cinnamon stick"], "Method": ["To make a mock rum syrup, put the dark brown muscovado sugar and 200ml water in a ", ", stir well and heat gently until the sugar has dissolved. Add a few strips of skin from the pineapple, add the black peppercorns, cloves and a cinnamon stick, then bring to the boil. Turn off the heat and leave to infuse until cold. Strain into a jug and set aside in the fridge until needed. ", "Pour the pineapple juice into a tall glass, and add the coconut milk and lime juice. Stir gently. Fill up the glass with a handful ice then slowly add 25ml of the syrup so it sinks to the bottom. Garnish with pineapple leaves and a tinned cherry."]},
{"Name": "Faux fizz", "url": "https://www.bbcgoodfood.com/recipes/faux-fizz", "Description": null, "Author": "Miriam Nice", "Ingredients": ["2 tsp apple cider vinegar", "sparkling water, to top up", "1 sliced pear", "4 dried apricots", "75g golden caster sugar", "25g honey", "1 sprig rosemary, plus extra to garnish (optional)", "1 strip lemon zest"], "Method": ["To make the base syrup, put the sliced pear, dried apricots, golden caster sugar, honey, sprig of rosemary and a strip of lemon zest in a saucepan with 100ml water. Heat for 10 mins or until the sugar has dissolved and the pear is very soft, then leave to cool completely.", "Strain the syrup into a jug, add the apple cider vinegar and chill in the fridge for at least 30 mins. Pour about 25ml of the syrup into a champagne flute and top with cold sparkling water. Garnish with a rosemary sprig, if you like."]},
{"Name": "Red cabbage with port, prunes & orange", "url": "https://www.bbcgoodfood.com/recipes/red-cabbage-port-prunes-orange", "Description": null, "Author": "BBC Good Food team", "Ingredients": ["50g butter", "1 large onion, sliced", "1 large red cabbage, quartered, cored and thinly sliced", "200ml port", "1 orange, juiced and zested", "1 large cinnamon stick", "pinch of ground cloves", "2 tbsp light brown soft sugar", "100g pitted prunes, roughly chopped"], "Method": ["Heat oven to 160C/140C fan/gas 3. Heat the butter in a casserole dish until sizzled to a nutty brown. Add the onion and fry for 15 mins over a medium heat until soft and starting to colour.", "Tip the remaining ingredients into a large pan and cover with a tight-fitting lid. Put in the oven for 1 hr, then stir, cover and cook for a further 1 hr until the cabbage is tender. If it looks dry, add a splash of water; if there’s still liquid in the pan once cooked, turn the heat up until it evaporates. Season with a little salt and serve. "]},
{"Name": "Cranberry & lentil bake", "url": "https://www.bbcgoodfood.com/recipes/cranberry-lentil-bake", "Description": null, "Author": "Katy Greenwood", "Ingredients": ["25g dried cranberries", "1 tbsp red wine", "125g cooked Puy lentils", "2 tsp olive oil", "½ onion, finely chopped", "½ garlic clove, crushed or finely grated", "1 tbsp chopped sage", "½ tbsp chopped parsley", "¼ tsp smoked paprika", "pinch ground cloves", "1 tsp tomato purée", "1 tsp soy sauce", "1 tsp cornflour"], "Method": ["Heat oven to 200C/180C fan/gas 6. Oil and line the base of a 200ml ovenproof ramekin with a circle of baking parchment. Put the cranberries in a small pan with the wine and cook for a couple of mins over a medium heat until the cranberries are plump and the wine syrupy. Pour into the base of the ramekin and set aside.", "Put the lentils in a bowl and roughly mash about half of them with a fork. Heat the oil in a small pan and cook the onion for 6-8 mins over a medium heat until softened. Stir in the garlic, herbs, paprika and cloves and cook for another minute. Turn off the heat and add the lentils, tomato purée, soy and cornflour, stir everything together well, then spoon into the ramekin, pressing down gently with the back of a spoon. ", " ", "Put the ramekin on a ", " and bake for 15 mins. Leave to cool for 1 min, then turn out onto a plate."]},
{"Name": "Giant jam tart", "url": "https://www.bbcgoodfood.com/recipes/giant-jam-tart", "Description": null, "Author": "Lulu Grimes", "Ingredients": ["500g pack sweet shortcrust pastry", "1 tsp cinnamonor a grating of nutmeg (optional)", "300g jam", "icing sugar, for dusting"], "Method": ["Heat oven to 180C/160C fan/gas 4 and put a ", " in the oven to heat up. On a lightly floured surface, ", " two-thirds of the pastry to a circle about 0.5cm thick. If you’re adding a spiced flavour to your pastry, sprinkle with the cinnamon or nutmeg, fold in half and repeat, then roll it out again to a circle about 0.5cm thick.", "Press the pastry into a 23cm metal pie tin or tart tin and trim off any excess pastry hanging over the edge. If you’re using a deep tin, roll the edges down a little to make a lip (you only want to make a shallow tart). Spread the jam over the pastry base.", "On a lightly floured surface, roll out the remaining pastry to a thickness of 0.5cm and use small cookie cutters to stamp out shapes. Re-roll the trimmings and cut out more shapes if needed. Arrange the pastry decorations over the jam layer.", "Put the tin on the hot baking tray and cook for 40 mins, then leave to cool for 15 mins. Dust the pastry toppings with icing sugar. Serve warm or cold with custard, cream or ice cream."]},
{"Name": "Super sausage rolls", "url": "https://www.bbcgoodfood.com/recipes/super-sausage-rolls", "Description": null, "Author": "Lulu Grimes", "Ingredients": ["375g all-butter puff pastry", "flour, for dusting", "2 tbsp apple sauce, pickle or chutney", "400g sausagemeator sausages, skins removed", "1 egg, beaten", "2 tsp sesame seedsor nigella seeds (optional)"], "Method": [" the pastry to a 35 x 30cm rectangle on a surface lightly dusted with flour. Trim the edges neatly, then cut in half lengthways to form two long strips. Spread with a thin layer of the apple sauce, pickle or chutney, leaving a border along the edges.", "Tip the sausagemeat into a ", ", add 3 tbsp cold water and squash together. Divide the mixture in two and mould each half into a cylindrical shape. Put each portion of meat into the middle of a pastry strip, leaving a border at either side. Brush the pastry border and the top of the sausage mix with the beaten egg. Fold one edge of the pastry over the meat and roll to encase, then use a fork to press the pastry edges together. Cut the sausage rolls into 5cm lengths and arrange on a lined baking tray. Chill for 20 mins. Can be made a day ahead or frozen for up to one month; to bake from frozen, add an extra 10 mins to the cooking time.", "Heat oven to 200C/180C fan/gas 6. Brush the sausage rolls with the rest of the beaten egg and sprinkle with the sesame seeds or nigella seeds (if using). Bake for 30-35 mins until the pastry is deep golden. Transfer the sausage rolls to a wire rack and leave to cool for 10 mins."]},
{"Name": "Chocolate & almond croissants", "url": "https://www.bbcgoodfood.com/recipes/863647/chocolate-and-almond-croissants", "Description": "Give your croissants an indulgent twist with this super simple brunch idea", "Author": "Good Food", "Ingredients": ["6 croissants", "100g marzipan, broken into small pieces", "50g toasted sliced almonds", "50g milk chocolate, chopped"], "Method": ["Heat oven to 180C/160C fan/gas 4. Slice into each croissant lengthways, but don’t go all the way through – they should open like books. Sprinkle or spread the bottom half of each with marzipan, followed by 1 tsp almonds and 1 tbsp chocolate.", "Close up, put on a baking sheet and sprinkle the remaining chocolate and almonds on top. Bake for 5 mins or until the chocolate has melted. Serve warm."]},
{"Name": "Ginger-spiced pears", "url": "https://www.bbcgoodfood.com/recipes/2601646/gingerspiced-pears", "Description": "Make and store preserved fruits for a month or so and serve alongside cold meats and cheeses", "Author": "Mary Cadogan", "Ingredients": ["500g granulated sugar", "500ml white wine vinegar", "pared zest (use a vegetable peeler) and juice 1 orange", "5cm piece ginger, thinly sliced (no need to peel)", "3 bay leaves", "1 tsp black peppercorn", "1½ kg small ripe pear"], "Method": ["Put the sugar, vinegar, orange zest and juice, ginger, bay leaves and peppercorns in a large pan. Bring slowly to the boil, stirring constantly to dissolve the sugar, then boil for 5 mins.", "Meanwhile, peel, core and halve or quarter the pears, depending on size. Add the pears to the pan and poach gently for 10-15 mins until they are just tender. Remove with a slotted spoon and pack into warm sterilised Kilner jars with rubber seals (see tip below).", "Boil the vinegar mixture hard to reduce by a third, then pour over the pears, including the spices. The pears need to be completely covered with the liquid. Fit the rubber seal and clamp the jar tightly closed. Reserve any leftover syrup for topping up the jars later, as the pears will absorb the syrup over time. "]},
{"Name": "Butter-basted pork loin with stuffing crust & cheesy polenta", "url": "https://www.bbcgoodfood.com/recipes/butter-basted-pork-loin-stuffing-crust-cheesy-polenta", "Description": "Bring big flavours and contrasting textures to your Sunday lunch table with this juicy roast pork, crusted with crunchy sage and onion stuffing", "Author": "Tom Kerridge", "Ingredients": ["1kg pork loin, bone out and skinned (see tip, below left), but with a good layer of fat", "½ tbsp rapeseed oil", "100g butter", "1 garlic bulb, cloves separated and bashed (save 2 for the stuffing)", "½ bunch rosemary, tied together", "2 tbsp picked lemon thymeleaves", "½ tsp ground white pepper", "zest and juice 2 lemons", "2 large or 4 small thick slices sourdough bread", "2 tbsp rapeseed oil", "½ tsp cayenne pepper", "2 garlic cloves", "1 tbsp dried sage", "1 tbsp dried onion", "6 tbsp finely chopped parsley", "600ml full-fat milk", "100g instant polenta", "100g butter", "50g parmesan, grated", "zest 1 lemon", "1 tbsp truffle oil(optional)", "½ fresh truffle, grated (optional)", "cayenne pepper, to taste", "2 tbsp finely snipped chives", "steamed Romanesco or broccoli, to serve", "toasted chopped hazelnuts, to serve"], "Method": ["First, make the stuffing crust, as this will keep. Heat oven to 140C/120C fan/gas 1. Place the slices of bread on a baking sheet, drizzle with the rapeseed oil and dust with the cayenne pepper. Bake in the oven until the bread is completely dry and browned just a little – this will take about 20 mins. Remove from the oven and rub with the garlic cloves while still warm. Use a whole clove on each slice, or half if you have small slices. Leave the toasted slices to cool, then put them in a food processor and blitz to rough but not too big breadcrumbs. Empty the crumbs into a mixing bowl and add the dried sage and onion, the parsley and a good pinch of sea salt. Mix together, then set aside in an airtight container. Can be made up to 2 days ahead without the parsley (see tip, below left).", "Turn down the oven to 120C/100C fan/ gas ½. Score the layer of fat on the pork with a sharp knife, working diagonally along the length, then score again in the opposite direction. Tie the loin with butcher’s string to help keep its shape and cook evenly. Heat the rapeseed oil in an ovenproof frying pan and add the pork, fat-side down. Sear and brown the top layer of fat, then turn the pork over and throw in the butter, garlic, rosemary, thyme, pepper and 2 tsp table salt. Once the butter has melted, add the lemon zest and juice to create a fragrant cooking liquor. Roll the pork around in the buttery juices and baste so that it is well coated.", "Place the pan with the pork in the oven and set your timer for 1 hr 15 mins. Baste the meat with the buttery juices every 15 mins. At the end of the cooking time, test the thickest part of the pork with a digital thermometer – it should read 70C when ready. If the meat hasn’t reached the temperature, return it to the oven for 5 mins, then check again. Once the pork is cooked, remove from the oven and leave to rest for 10 mins. If you don’t have a digital thermometer, cook the pork for 1 hr 20 mins.", "While the pork is resting, pour the milk for the polenta into a saucepan and bring to the boil. Whisk in the polenta and cook over a medium heat until thickened, following pack instructions – it needs to be the texture of creamy mash. If your polenta is too thick, add a little more milk to loosen it. When it is ready, remove from the heat and whisk in the butter, Parmesan, lemon zest, truffle oil, fresh truffle (if using), salt and the cayenne to taste. Pour into a serving bowl and sprinkle over the chives.", "Untie the rested pork loin and give it a final baste with the cooking liquor. Tip the crust into a roasting tin, then roll the pork loin in it, making sure it gets a good covering. Thickly slice the pork and serve with the soft polenta, Romanesco or broccoli sprinkled with toasted hazelnuts, and the buttery juices."]},
{"Name": "Sage and Onion Sauce", "url": "https://www.bbcgoodfood.com/recipes/3250/sage-and-onion-sauce", "Description": "A great accompaniment to roast duck that can be made in advance", "Author": "Ruth Watson", "Ingredients": ["all the innards, wings and bones from the ducks", "100ml marsala", "1 medium onion, peeled and chopped", "1 large leek, trimmed, washed and chopped", "1 bay leaf, fresh or dried", "1 sprig fresh thyme", "large sprigs fresh parsley", "25g butter", "1 tbsp olive oil", "2 medium onions, peeled and finely diced", "100g marsala", "300ml dry white wine", "6 large fresh sage leaves, finely chopped", "142ml carton double cream"], "Method": ["Preheat the oven to 230C/Gas 8/fan oven 210C. Brown the duck bits in the oven for about 30 minutes. Transfer to a stockpot. Discard the fat and place the tin over a medium-high flame. Pour in the Marsala and 200ml/7fl oz cold water, bring to the boil and scrape any stuck-on bits into the liquid. Boil for 2 minutes then scrape everything into the stockpot.", "Add 2.25 litres/4 pints cold water to the pot and bring to the boil over a medium heat, uncovered. Scoop off any scum, then add the vegetables and herbs. Bring back to the boil, de-scum again.", "Now very gently simmer for 2 hours, adding cold water if the liquid falls below the level of the bones. Remove from the heat and drain through muslin-lined colander (or use a clean tea towel) into a heatproof bowl. Cool, then refrigerate until jellied.", "Heat the butter and oil in a large, nonstick frying pan over a low-medium heat, then tip in the onions. Cook for about 30 minutes, stirring occasionally, until meltingly soft. Turn heat to high, add the Marsala and boil for 3-4 minutes, stirring often, until onions are syrupy. Set aside.", "Meanwhile, remove the solidified fat from the stock and discard. Boil the stock in a saucepan, uncovered, until reduced to 500ml/18fl oz. Add the white wine and boil for 10 minutes, uncovered. Add the onions and sage and bring back to the boil. (Prepare in advance up to this point.)", "To finish the sauce, pour in the cream and boil furiously for 4-5 minutes, season to taste. Serve in a warmed jug."]}
]